[
    {
        "symbol": "AAPL",
        "headline": "Apple internally weighs bid for ChatGPT rival Perplexity, Bloomberg says",
        "source": "Yahoo",
        "datetime": 1750457213,
        "url": "https://finnhub.io/api/news?id=3b36b6bb7cf5745314b9b70336ea9216685f6531fea2c2487e600571b035b1fe",
        "summary": "Investing.com -- Apple Inc (NASDAQ:AAPL) has held internal discussions about acquiring Perplexity AI, a fast-growing artificial intelligence startup known for its advanced chatbot platform. The talks, reported by Bloomberg and involving senior executives including M&A chief Adrian Perica and services head Eddy Cue, are still at an early stage and may not result in a formal offer."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple (AAPL) Rises As Market Takes a Dip: Key Facts",
        "source": "Yahoo",
        "datetime": 1750455903,
        "url": "https://finnhub.io/api/news?id=88f38b82d3bb53d633d9f3386f5acfa48a1dd952f410e99f63a9ad6043ace405",
        "summary": "Apple (AAPL) concluded the recent trading session at $201.00, signifying a +2.25% move from its prior day's close."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple executives held internal talks about buying Perplexity, Bloomberg News reports",
        "source": "Yahoo",
        "datetime": 1750455098,
        "url": "https://finnhub.io/api/news?id=3831cce6fa069d7e25404f84bc3ebd1b79ee1fdfb6a17e571844bd94a8764d6d",
        "summary": "The discussions are at an early stage and may not lead to an offer, the report said, adding that the tech behemoth's executives have not discussed a bid with Perplexity's management.  Apple and Perplexity did not immediately respond to Reuters' requests for comment.  Bloomberg News reported earlier on Friday that Meta Platforms tried to buy Perplexity earlier this year."
    },
    {
        "symbol": "AAPL",
        "headline": "Stocks Settle Mostly Lower as Chip Makers Fall",
        "source": "Yahoo",
        "datetime": 1750452696,
        "url": "https://finnhub.io/api/news?id=0536a6cfec66b388e638221ccfa658f4256f085bed7679739e0e44264b715dbb",
        "summary": "The S&P 500 Index ($SPX ) (SPY ) Friday closed down -0.22%, the Dow Jones Industrials Index ($DOWI ) (DIA ) closed up +0.08%, and the Nasdaq 100 Index ($IUXX ) (QQQ ) closed down -0.43%. September E-mini S&P futures (ESU25 ) are down -0.21%, and September E-mini Nasdaq futures..."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Hardware Executive Says iPhone Maker Plans To Use AI For Speeding Up Custom Chip Design: 'High Potential In Getting More Design Work In Less Time'",
        "source": "Yahoo",
        "datetime": 1750451489,
        "url": "https://finnhub.io/api/news?id=2740ef90d742bfb26bd6a3223b43df92490aa99e5d3c69c82f042288580930c5",
        "summary": "Apple Inc. (NASDAQ:AAPL) is reportedly looking to harness the power of generative artificial intelligence to accelerate the development of the custom chips that power its devices, according to senior executive Johny Srouji. What Happened: During a speech in Belgium last month, Apple's senior vice president of hardware technologies, Srouji, said the company is exploring generative AI to streamline chip design, calling it a major productivity opportunity, reported Reuters on Wednesday. \"Generative"
    },
    {
        "symbol": "AAPL",
        "headline": "Analysts reboot Micron Technology stock price target ahead of earnings",
        "source": "Yahoo",
        "datetime": 1750450020,
        "url": "https://finnhub.io/api/news?id=34354ce20740d15a7e736fc47238acd1de59911c845415cb1a2113571176dfd9",
        "summary": "This is what could happen next with shares of Micron Technology."
    },
    {
        "symbol": "AAPL",
        "headline": "Don't Overlook Jabil (JBL) Stock After Topping Its Q3 Expectations",
        "source": "Yahoo",
        "datetime": 1750449240,
        "url": "https://finnhub.io/api/news?id=66b4a38f0601280a5934d2a3eb1f425be8926bc14173f4412eb250b231057273",
        "summary": "Trading near 52-week highs of over $200 a share, Jabil (JBL) stock may be poised for more upside after posting strong results for its fiscal third quarter this week."
    },
    {
        "symbol": "AAPL",
        "headline": "A New ETF Gives You Warren Buffett’s Stock Portfolio, Plus a Bonus",
        "source": "MarketWatch",
        "datetime": 1750446480,
        "url": "https://finnhub.io/api/news?id=fcbc041bbf663ae55a5d9ab239992248f4506f5ae6143e749c80f8dc2c95cb4b",
        "summary": "A New ETF Gives You Warren Buffett’s Stock Portfolio, Plus a Bonus"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple sued by shareholders for allegedly overstating AI progress",
        "source": "Yahoo",
        "datetime": 1750444118,
        "url": "https://finnhub.io/api/news?id=31d11dd0faa7108ec77eaee02b73ac0cda6e398b32708b4699e289d694cefd11",
        "summary": "(Reuters) -Apple was sued on Friday by shareholders in a proposed securities fraud class action that accused it of downplaying how long it needed to integrate advanced artificial intelligence into its Siri voice assistant, hurting iPhone sales and its stock price.  The complaint covers shareholders who suffered potentially hundreds of billions of dollars of losses in the year ending June 9, when Apple introduced several features and aesthetic improvements for its products but kept AI changes modest.  Apple did not immediately respond to requests for comment."
    },
    {
        "symbol": "AAPL",
        "headline": "Binance’s CZ issues blunt wake-up call to not one — but two — planets",
        "source": "Yahoo",
        "datetime": 1750440600,
        "url": "https://finnhub.io/api/news?id=f7bcb10054906281106d3b9498fa0c9d5d1a8d07876420e1a5032314fa9c6179",
        "summary": "Binance's CZ addresses the latest data leak exposing 16 billion passwords."
    },
    {
        "symbol": "AAPL",
        "headline": "Stocks Erase Early Gains on Weakness in Chip Makers",
        "source": "Yahoo",
        "datetime": 1750433656,
        "url": "https://finnhub.io/api/news?id=77651d284a6ea0816562226cc9b9d5af62a8cbd4b543c95d4032c3ca2e994e82",
        "summary": "The S&P 500 Index ($SPX ) (SPY ) today is down -0.26%, the Dow Jones Industrials Index ($DOWI ) (DIA ) is up +0.09%, and the Nasdaq 100 Index ($IUXX ) (QQQ ) is down -0.59%. September E-mini S&P futures (ESU25 ) are down -0.16%, and September E-mini Nasdaq futures..."
    },
    {
        "symbol": "AAPL",
        "headline": "Trump Pledge of Quick China Magnet Flows Has Yet to Materialize",
        "source": "Yahoo",
        "datetime": 1750432500,
        "url": "https://finnhub.io/api/news?id=4e14b68267acc9dadd22877655c2d79d5b3e526412e7ac2f0b6ae799422a2476",
        "summary": "(Bloomberg) -- Almost 10 days since President Donald Trump declared a “done” trade deal with Beijing, US companies remain largely in the dark on when they’ll receive crucial magnets from China — and whether Washington, in turn, will allow a host of other exports to resume.Most Read from BloombergSecurity Concerns Hit Some of the World’s ‘Most Livable Cities’One Architect’s Quest to Save Mumbai’s Heritage From DisappearingJFK AirTrain Cuts Fares 50% This Summer to Lure Riders Off RoadsNYC Congest"
    },
    {
        "symbol": "AAPL",
        "headline": "Barron’s 2025 Top CEO List Is Out. See Who Made the Cut.",
        "source": "Yahoo",
        "datetime": 1750431780,
        "url": "https://finnhub.io/api/news?id=eea03f4be3739e2ac8768a06c1123464d04550fb2c2074ff0316185fc4bb4276",
        "summary": "Our annual list features 26 leaders whose deft guidance has put their companies in a stronger competitive position."
    },
    {
        "symbol": "AAPL",
        "headline": "Barron’s 2025 Top CEOs Are Out. See Who Made the List.",
        "source": "Yahoo",
        "datetime": 1750431780,
        "url": "https://finnhub.io/api/news?id=fc8cffb5399db0d872c490b058a757a3e3a6430b47815e8d111f2dc603b2c309",
        "summary": "Our annual list features 25 leaders whose deft guidance has put their companies in a stronger competitive position."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple sued by shareholders over AI disclosures",
        "source": "Finnhub",
        "datetime": 1750429749,
        "url": "https://finnhub.io/api/news?id=4dc2997f04dab9d69a54a3aaf6b8f45e4b269b54878bff3add9ee54e86af405e",
        "summary": "Apple was sued by shareholders in a proposed class action on Friday, accusing it of downplaying the time needed to integrate advanced artificial intelligence-based features into its Siri assistant,..."
    },
    {
        "symbol": "AAPL",
        "headline": "Trump Hints He’ll Hold Off Iran Strike, Give Diplomacy Time",
        "source": "Yahoo",
        "datetime": 1750420130,
        "url": "https://finnhub.io/api/news?id=0e09fcef55de6e99970080b1a13f06f57e37043ebd93cd52a53a0adec55b1ad5",
        "summary": "(Bloomberg) -- US President Donald Trump signaled he would give diplomacy a chance before deciding whether to strike Iran, dialing back on recent comments that suggested military action could be imminent.Most Read from BloombergSecurity Concerns Hit Some of the World’s ‘Most Livable Cities’One Architect’s Quest to Save Mumbai’s Heritage From DisappearingJFK AirTrain Cuts Fares 50% This Summer to Lure Riders Off RoadsNYC Congestion Toll Cuts Manhattan Gridlock by 25%, RPA ReportsTaser-Maker Axon"
    },
    {
        "symbol": "AAPL",
        "headline": "If I Could Only Buy 2 Dividend Stocks: June's Top Picks For Global Diversification",
        "source": "SeekingAlpha",
        "datetime": 1750428000,
        "url": "https://finnhub.io/api/news?id=f05a704562cca6687674af598ce9829b9c4693850a3325ea4d3999345da08620",
        "summary": ""
    },
    {
        "symbol": "AAPL",
        "headline": "Garmin’s CEO Made His Company an Electronics Leader. Its Stock Has Outrun Apple’s.",
        "source": "Yahoo",
        "datetime": 1750426200,
        "url": "https://finnhub.io/api/news?id=b2dea7758745c864252d70ba690f214d1b121213a4d453dcb65a206db6294ec4",
        "summary": "Garmin  has spent two decades in the middle of a disruptive storm.  Then its consumer fitness devices were matched by smartwatches.  While other companies have folded under less pressure, Olathe, Kan.–based Garmin has thrived."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Inc. (AAPL) Is a Trending Stock: Facts to Know Before Betting on It",
        "source": "Yahoo",
        "datetime": 1750424402,
        "url": "https://finnhub.io/api/news?id=7c3988765c6a7347461aa1de8df144fecd6fecf1f8f6a01b6c627e3fbf2e1600",
        "summary": "Apple (AAPL) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock."
    },
    {
        "symbol": "AAPL",
        "headline": "Alibaba’s (BABA) New Qwen3 AI Models Now Compatible With Apple Devices",
        "source": "Yahoo",
        "datetime": 1750423731,
        "url": "https://finnhub.io/api/news?id=4b44b0215f17abb455cf9e734ad3766cec2d7e820ccd2e12cd0e3375e5c0f7ba",
        "summary": "Alibaba Group Holding Limited (NYSE:BABA) is one of the 10 AI Stocks Getting Wall Street’s Attention. On June 17, South China Morning Post reported that the company updated its Qwen3 family of artificial intelligence (AI) models that could signal the potential roll-out in China of machine-learning technology on a range of Apple devices, including iPhones, iPads, and […]"
    },
    {
        "symbol": "AAPL",
        "headline": "This Week In Cloud AI - Boosting AI Efficiency With Advanced Power Delivery Solutions",
        "source": "Yahoo",
        "datetime": 1750423060,
        "url": "https://finnhub.io/api/news?id=c006a13e4ef5d9d64ca284eea0ad3dfb933962acd6751b78a6fdb9a706ac7ef2",
        "summary": "Empower Semiconductor and Marvell Technology have announced a collaboration to advance power delivery solutions for AI and cloud platforms. The initiative focuses on developing high-performance, integrated power silicon chips for Marvell's custom silicon platforms. This collaboration aims to enhance the power efficiency of hyperscale and infrastructure providers by integrating power delivery systems closely with processors. Utilizing Empower's FinFast™ technology and vertical power delivery..."
    },
    {
        "symbol": "AAPL",
        "headline": "Market Chatter: Apple, Meta Won't Face Immediate EU Fines as DMA Grace Period Nears End",
        "source": "Yahoo",
        "datetime": 1750421283,
        "url": "https://finnhub.io/api/news?id=d6a2551a33dcc2a856023107a1485ab918f722c29390a2da7fdaca05d1b35775",
        "summary": "Apple (AAPL) and Meta Platforms (META) will not face immediate sanctions for failing to comply with"
    },
    {
        "symbol": "AAPL",
        "headline": "Qualcomm's Inflection: Is AI The Next Apple?",
        "source": "SeekingAlpha",
        "datetime": 1750419226,
        "url": "https://finnhub.io/api/news?id=80ac0431ae075d255a948d189505afe01a535fb2493b9cccd552d3e829ada071",
        "summary": ""
    },
    {
        "symbol": "AAPL",
        "headline": "Qualcomm: No Point To Keep Fighting Against The Market (Rating Downgrade)",
        "source": "SeekingAlpha",
        "datetime": 1750419000,
        "url": "https://finnhub.io/api/news?id=610d39d0125e09db1b598549f3db7ed51c22afed5aa39b83569f41180277be6a",
        "summary": "Is Qualcomm still worth the investment? Explore concerns about its growth, diversification struggles, and why it might be time to consider new..."
    },
    {
        "symbol": "AAPL",
        "headline": "Alphabet Stock Is Flat... But Not For Long",
        "source": "SeekingAlpha",
        "datetime": 1750418001,
        "url": "https://finnhub.io/api/news?id=a8a23e1c3bf920d13c42a4cc717c94594273faa41751899a571638e6e22e13c2",
        "summary": "Alphabet remains resilient with strong financials, cloud expansion via Wiz, and undervaluation despite legal risks. Find out why GOOGL stock is a Strong Buy."
    },
    {
        "symbol": "AAPL",
        "headline": "Nasdaq erases early gains, weighed down by Big Tech stocks",
        "source": "MarketWatch",
        "datetime": 1750415830,
        "url": "https://finnhub.io/api/news?id=9a596465818fc7363ce375f37547bd652e59c997a0181f8f4bd7300c4d41772c",
        "summary": "Nasdaq erases early gains, weighed down by Big Tech stocks"
    },
    {
        "symbol": "AAPL",
        "headline": "Meta Wanted to Buy a $30 Billion AI Startup: Report. What It Is Trying Instead.",
        "source": "MarketWatch",
        "datetime": 1750415640,
        "url": "https://finnhub.io/api/news?id=9caa103d105dfdb6413d444c516db0ba7b13b384bc0234ddfe8deb11ee560032",
        "summary": "Meta Wanted to Buy a $30 Billion AI Startup: Report. What It Is Trying Instead."
    },
    {
        "symbol": "AAPL",
        "headline": "castLabs delivers new React Native player SDK to expand 3SS' 3Ready solution for Proximus",
        "source": "Yahoo",
        "datetime": 1750410000,
        "url": "https://finnhub.io/api/news?id=b32b31e5407b8229da8c3e362878a59b1d213efde4329d644b4c7bade3f4a378",
        "summary": "castLabs, a global pioneer in premium digital video technology, and 3 Screen Solutions (3SS), leading provider of software solutions for set-top boxes (STB), smart TV, multiscreen and in-vehicle entertainment, have partnered to co-create and deliver a cutting-edge, React Native-powered player solution for the Proximus Pickx super-aggregated entertainment platform. Starting with castLabs building a dedicated new SDK, this collaborative solution will provide viewers with an elevated streaming expe"
    },
    {
        "symbol": "AAPL",
        "headline": "Should You Buy the Dip on Apple Stock This Year?",
        "source": "Yahoo",
        "datetime": 1750409700,
        "url": "https://finnhub.io/api/news?id=7f14193a3522549faf28361935d4fef9a956e2e77136e130806b7f7743d735af",
        "summary": "Apple is still driven by iPhone sales, and it failed to successfully launch the Vision Pro headset.  After peaking at around $260 near the end of 2024, Apple's (NASDAQ: AAPL) stock price has entered a bear market.  Investors are worried about tariffs, slowing revenue growth, and antitrust lawsuits that may impact the smartphone maker's future earnings power."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Stock Price Struggles To Rebound As Price Slips Toward $194 Support",
        "source": "SeekingAlpha",
        "datetime": 1750405680,
        "url": "https://finnhub.io/api/news?id=4706df29f12f3f625b50f9d3808f281e30f17a65db2a8860aca588ecb779055a",
        "summary": "Apple closed at $196.08 on June 19 amid persistent selling pressure below the $200 mark. Click to read."
    },
    {
        "symbol": "AAPL",
        "headline": "Key Mega-Caps Move From Pure Growth To Partial Value: 2025 Russell Recon Style Shifts",
        "source": "SeekingAlpha",
        "datetime": 1750401840,
        "url": "https://finnhub.io/api/news?id=40a0b27e580fde6ff7d69b7865819d0945e9e903bd76adf7b1aee6550f139ac1",
        "summary": ""
    },
    {
        "symbol": "AAPL",
        "headline": "Social Media Ban Moves Closer in Australia After Tech Trial",
        "source": "Yahoo",
        "datetime": 1750382083,
        "url": "https://finnhub.io/api/news?id=0405d6b92f98e1c5112dba2a907a85d4325437e55cca594a18b1b1091292a539",
        "summary": "(Bloomberg) -- Australia’s world-first social media ban for under-16s moved closer to implementation after a key trial found that checking a user’s age is technologically possible and can be integrated into existing services.Most Read from BloombergSecurity Concerns Hit Some of the World’s ‘Most Livable Cities’JFK AirTrain Cuts Fares 50% This Summer to Lure Riders Off RoadsNYC Congestion Toll Cuts Manhattan Gridlock by 25%, RPA ReportsTaser-Maker Axon Triggers a NIMBY Backlash in its HometownOne"
    },
    {
        "symbol": "AAPL",
        "headline": "Steve Jobs Once Gave A Secretary A Brand New Jaguar Out Of The Blue, Here Is Why The Apple Co-Founder Was So Generous",
        "source": "Yahoo",
        "datetime": 1750368653,
        "url": "https://finnhub.io/api/news?id=673ec3cc521ceaff3dce06e9a0f315197ca8cd1498110e17fd175223113a92e5",
        "summary": "Steve Jobs earned a reputation for merciless standards, yet sometimes his demand for perfection came wrapped in jaw-dropping generosity. What Happened: Ron Givens, Apple's (NASDAQ:AAPL) director of quality from 1981 to 1986, recalled the day a secretary shuffled in late. Jobs stormed over to ask why, and she admitted her car had died that morning. \"That afternoon, he walks into her office, tosses a set of keys to a brand-new Jaguar and says, ‘Here, don't be late anymore,'\" Givens told WRAL in an"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Taps AI to Design Next-Gen Chips: Exec Hints at Major Shift",
        "source": "Yahoo",
        "datetime": 1750359376,
        "url": "https://finnhub.io/api/news?id=c390428055a2e38d823f88edfc4dc24352d90ed1009684f319f6095dbe9afd92",
        "summary": "Apple May Use AI to Build Chips Faster Than Ever, Exec Signals"
    },
    {
        "symbol": "AAPL",
        "headline": "The Week in AI: \"All incumbents are gonna get nuked.\"",
        "source": "Yahoo",
        "datetime": 1750354560,
        "url": "https://finnhub.io/api/news?id=8dbec3e05b772fc9deec134d1058bd4f6d4b28e521230ac4f0469ed152bfc98b",
        "summary": "A new civil war in AI, Andreessen's rant, and Zuck splashes the pot."
    },
    {
        "symbol": "AAPL",
        "headline": "India’s high-tech ambitions get a boost from Apple and US tariffs",
        "source": "Yahoo",
        "datetime": 1750349091,
        "url": "https://finnhub.io/api/news?id=294a1d422d80abca726e7ef151a38add31f6b073862f9ba975039ad6a569e0fb",
        "summary": "Even before Trump’s latest trade war, India was gunning for a greater slice, not only of the smartphone industry, but the entire supply chain, hoping to lure more international businesses away from China. Now, with Apple announcing it will build all US-bound smartphones in India, and US tariffs potentially handing it a competitive advantage, India is seeing new momentum. CNN’s Clare Sebastian visits a city outside Delhi that has been transformed by India’s hi-tech ambitions."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Explores AI to Speed Custom Chips",
        "source": "Yahoo",
        "datetime": 1750344552,
        "url": "https://finnhub.io/api/news?id=6933daa77ee87743dbc424d44c2ee53265a32f09676883f558298a39e49c0c26",
        "summary": "AI-enhanced EDA tools from Cadence and Synopsys could redefine chip development"
    },
    {
        "symbol": "AAPL",
        "headline": "Trump Trade: President said to weigh possible U.S. strike against Iran",
        "source": "Yahoo",
        "datetime": 1750342255,
        "url": "https://finnhub.io/api/news?id=f9b18d6d502f4174efdb1675c6cb1394a78b09ebbc0a76e2ff74eb8119e3385e",
        "summary": "Catch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: IRAN: U.S. President Donald Trump is weighing a range of potential actions in response to a recent armed conflict between Israel and Iran, including a possible U.S. strike against Iran, and met with top White House advisers to discuss the matter on Tuesday, the Wall Street Journal reports, citing"
    },
    {
        "symbol": "AAPL",
        "headline": "Dan Ives' Wedbush Just Launched an ETF -- Should You Buy In?",
        "source": "Yahoo",
        "datetime": 1750341600,
        "url": "https://finnhub.io/api/news?id=a4eb3b5a34f8b07cb831f049279f4101109e01d2f03f5a5c6367590bc1061643",
        "summary": "The Dan Ives Wedbush AI Revolution ETF invests in companies at the forefront of innovation.  A 0.75% expense ratio is pricey, but could be worth it if the Ives ETF strategy manages to outperform.  Prominent Wall Street analyst Dan Ives, a frequent voice in financial media and an expert in disruptive technologies like artificial intelligence (AI), has launched the Dan Ives Wedbush AI Revolution ETF (NYSEMKT: IVES)."
    },
    {
        "symbol": "AAPL",
        "headline": "Should You Forget Apple and Buy 2 Artificial Intelligence (AI) Stocks Instead?",
        "source": "Yahoo",
        "datetime": 1750334400,
        "url": "https://finnhub.io/api/news?id=b27ce073ef9bf605c2e2d24020266a5730fda45bc6e1096bf996c544e4c3746d",
        "summary": "Apple is falling behind in the artificial intelligence field, and the business is growing slowly.  ASML and Taiwan Semiconductor can benefit from increased spending on AI computer chips.  Both semiconductor-related companies are projected to grow faster than Apple this year."
    },
    {
        "symbol": "AAPL",
        "headline": "Why UBS Is the Only Wirehouse to Allow Podcasting",
        "source": "Yahoo",
        "datetime": 1750327500,
        "url": "https://finnhub.io/api/news?id=e582b5abd3d434d567d6dfe6cfb28da4729ecbe4c096829b0c9b00c692f6f11a",
        "summary": "For years, Mitch Slater urged UBS to let its advisors launch their own shows. Now, more than 50 advisors have them."
    },
    {
        "symbol": "AAPL",
        "headline": "Is This the Real Reason Apple Is So Far Behind Its Rivals on Artificial Intelligence?",
        "source": "Yahoo",
        "datetime": 1750323000,
        "url": "https://finnhub.io/api/news?id=f2353b0e4a7afa4e53dd9ae24da9f570ecf022c408a023ee0bf9247654a1fc09",
        "summary": "Apple's valuation has nosedived this year as it has fallen behind its peers on next-gen technologies.  The company's researchers aren't convinced that generative artificial intelligence can reason like humans.  Apple (NASDAQ: AAPL) has disappointed investors this year."
    },
    {
        "symbol": "AAPL",
        "headline": "The Best Warren Buffett Stocks to Buy With $1,000 Right Now",
        "source": "Yahoo",
        "datetime": 1750319100,
        "url": "https://finnhub.io/api/news?id=13e14ebfd60da62829a5ea9dcc6076eb9ed85a7342294536621f1a3c9245bff7",
        "summary": "Amazon is using artificial intelligence to strengthen its e-commerce business.  Apple has a growing installed base of devices and is generating nearly $100 billion in annual profit.  Warren Buffett is one of the greatest investors of all time."
    },
    {
        "symbol": "AAPL",
        "headline": "Leveling Up: The Emerging Trends Shaping The Video Gaming Industry—and How Companies Can Secure Sustainable Growth",
        "source": "Finnhub",
        "datetime": 1750313593,
        "url": "https://finnhub.io/api/news?id=25d390cb132e05a05d55fe8608a72a5b6cef9c41a3a8885f14896b229f577d0f",
        "summary": "From 2018 to 2021, the global video-gaming market exploded, with a blistering 11.8% compound annual growth rate . A proliferation of new players, fueled by expanding smartphone ownership and..."
    },
    {
        "symbol": "AAPL",
        "headline": "2 Reasons to Like GSAT and 1 to Stay Skeptical",
        "source": "Yahoo",
        "datetime": 1750305769,
        "url": "https://finnhub.io/api/news?id=c2ce679e12ee4eacddbfe92ef556eef049fb8a512604383f946d7b2eb1f14128",
        "summary": "Over the last six months, Globalstar’s shares have sunk to $23.83, producing a disappointing 15.5% loss - a stark contrast to the S&P 500’s 1.9% gain. This was partly driven by its softer quarterly results and might have investors contemplating their next move."
    },
    {
        "symbol": "AAPL",
        "headline": "Trump's Plan To Take On Apple, Samsung With A Smartphone Is A 'Fairytale': Dan Ives Warns — It Could Be A Money-Loser For His Company",
        "source": "Yahoo",
        "datetime": 1750300224,
        "url": "https://finnhub.io/api/news?id=81677de732520549fedc24bf82ceedd90c48d3d97154ae703f89bc2f8334cf50",
        "summary": "After President Donald Trump‘s sons unveiled Trump Mobile on Monday, Wedbush analyst Daniel Ives described manufacturing phones in the U.S. as “a non-starter,” deeming it unprofitable. What Happened: Dan Ives, in an X post, highlighted his conversation with ABC News, where he confirmed that trying to manufacture a phone in the U.S. wasn’t a profitable venture. “Could the Trump organization produce phones, a few thousand, and probably lose money? Yeah! But the reality to produce phones in the U.S"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple interested in using AI to design custom chips- Reuters, citing exec",
        "source": "Yahoo",
        "datetime": 1750294366,
        "url": "https://finnhub.io/api/news?id=1bb26260888dcfcb3affd563fdb67f3d65d803b352cfbf7054017e29fd568fba",
        "summary": "Investing.com-- Apple Inc (NASDAQ:AAPL) is interested in using generative artificial intelligence to help design its custom chips, Reuters reported on Wednesday, citing recent comments from a top executive in the technology giant."
    },
    {
        "symbol": "AAPL",
        "headline": "Analysts reset Qualcomm stock price target, send warning",
        "source": "Yahoo",
        "datetime": 1750293420,
        "url": "https://finnhub.io/api/news?id=5a394b822d3f8abefba030dc17261bbb1731255ac2b9b2a3055bdbe0f222a2da",
        "summary": "Analysts provided their opinion on this business in transition."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple eyes using AI to design its chips, technology executive says",
        "source": "Yahoo",
        "datetime": 1750288583,
        "url": "https://finnhub.io/api/news?id=35d31774fb34933b178a0f95b888af7c441a7bceb81e6907c8c16c2fc5efb205",
        "summary": "SAN FRANCISCO (Reuters) -Apple is interested in tapping generative artificial intelligence to help speed up the design of the custom chips at the heart of its devices, its top hardware technology executive said in private remarks last month.  Johny Srouji, Apple's senior vice president of hardware technologies, made the remarks in a speech in Belgium, where he was receiving an award from Imec, an independent semiconductor research and development group that works closely with most of the world's biggest chipmakers.  In the speech, a recording of which was reviewed by Reuters, Srouji outlined Apple's development of custom chips from the first A4 chip in an iPhone in 2010 to the most recent chips that power Mac desktop computers and the Vision Pro headset."
    },
    {
        "symbol": "AAPL",
        "headline": "Adobe vs. Apple: Which AI-Driven Tech Stock is a Better Buy Now?",
        "source": "Yahoo",
        "datetime": 1750267320,
        "url": "https://finnhub.io/api/news?id=4f068fba240a949bbb7762fde97c8c486f8c91ad52c3f67c6f33fe6ed825403c",
        "summary": "Both Adobe and Apple are infusing AI into their core offerings. However, which stock, AAPL or ADBE, is a better buy?"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Just Erased a $300 Million Problem--But a $500M One Still Lurks",
        "source": "Yahoo",
        "datetime": 1750265613,
        "url": "https://finnhub.io/api/news?id=6d086dc6d16c899dc3ce5d0391e53c78fe226c5078bea7bdc73a519df89a0d20",
        "summary": "A surprise courtroom reversal gives Apple breathing room in its patent war with Optis--just as pressure builds overseas."
    },
    {
        "symbol": "AAPL",
        "headline": "Texas Instruments to invest more than $60 billion to make semiconductors in the US",
        "source": "Yahoo",
        "datetime": 1750265108,
        "url": "https://finnhub.io/api/news?id=388d52af39930043194e6096dca389f799f2c7ba940b8bb8555bfb37382eaa97",
        "summary": "Texas Instruments will invest more than $60 billion to expand semiconductor manufacturing in the United States, the company announced on Wednesday, as President Donald Trump continues to pressure tech giants like Apple and Samsung to build their products in America."
    },
    {
        "symbol": "AAPL",
        "headline": "Credit Card Annual Fees Are Going Up. What It Means for the Stocks.",
        "source": "Yahoo",
        "datetime": 1750265040,
        "url": "https://finnhub.io/api/news?id=cc26a4fa5551d474da9e7d609f6f5ce468bf1a1ada8de82648d86d7980c8e7f8",
        "summary": "Credit card issuers are trying to attract more higher-end customers with the promise of more rewards.  Chase announced new perks for holders of its Sapphire Reserve credit cards on Tuesday, including a new points boost program, expanded access to airport lounges, and promotional spending credits with partners such as  Apple Lyft DoorDash  StubHub, and Peloton.  The question now, though, is how Chase competitors react to the news of the fee hike."
    },
    {
        "symbol": "AAPL",
        "headline": "The Trump phone probably won’t be built in America (and may never be)",
        "source": "Yahoo",
        "datetime": 1750263665,
        "url": "https://finnhub.io/api/news?id=e9ee5f7addb9707a8afdc2ecfdd09c903af30a818ff61d63a24ac3014bb1b8ed",
        "summary": "President Trump's family is launching a smartphone. But it might never be built in America like the company claims."
    },
    {
        "symbol": "AAPL",
        "headline": "Texas Instruments commits $60B to domestic chip manufacturing",
        "source": "Yahoo",
        "datetime": 1750260491,
        "url": "https://finnhub.io/api/news?id=aa578406648dcea7b450ab035d591d94c0258b7a23ac7f714e067059fc66a0cf",
        "summary": "New plants in Texas and Utah will produce foundational semiconductors for Apple, Ford and Nvidia, the nearly 100-year-old tech company said Wednesday."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple: Quiet After WWDC",
        "source": "SeekingAlpha",
        "datetime": 1750258995,
        "url": "https://finnhub.io/api/news?id=8fbc130aed6ad7952cb0167a47443acd4bfeb70623aa1f3e680896ccfb965b9b",
        "summary": ""
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Just Snatched Back the Top Spot in China Smartphone Sales. Should You Buy AAPL Stock Here?",
        "source": "Yahoo",
        "datetime": 1750257002,
        "url": "https://finnhub.io/api/news?id=23afc28b868ae10b06ef180a3e17a237a5e0fbf8624ca8e200aa2a33f3733dd2",
        "summary": "Data showed that iPhones claimed the top spot for smartphones in China. With this return to growth, should you consider buying Apple now?"
    },
    {
        "symbol": "AAPL",
        "headline": "Analysts Cover Apple (NASDAQ:AAPL) After WWDC, Citi Maintains Buy",
        "source": "Yahoo",
        "datetime": 1750254925,
        "url": "https://finnhub.io/api/news?id=b8fb845c5e8f1cc15cbd0a3d272dc150fcb8886b0e0195f18bfd1340a5c08f92",
        "summary": "Apple Inc. (NASDAQ:AAPL) is one of the 10 stocks that Jim Cramer and analysts are watching. After the initial keynote at the company’s Worldwide Developers Conference (WWDC), several analysts covered the stock. On June 10, Citi maintained a Buy rating and a $240 price target on the stock and sees the event as a strong […]"
    },
    {
        "symbol": "AAPL",
        "headline": "Texas Instruments plans to invest more than $60 billion to manufacture billions of foundational semiconductors in the U.S.",
        "source": "Yahoo",
        "datetime": 1750251540,
        "url": "https://finnhub.io/api/news?id=18580ff8d4455779be1102215ee24b018b6bbe3c34844a5551484f57f2dbac41",
        "summary": "Texas Instruments (TI) (Nasdaq: TXN) today announced its plans to invest more than $60 billion across seven U.S. semiconductor fabs, making this the largest investment in foundational semiconductor manufacturing in U.S. history. Working with the Trump administration and building on the company's nearly 100-year legacy, TI is expanding its U.S. manufacturing capacity to supply the growing need for semiconductors that will advance critical innovations from vehicles to smartphones to data centers."
    },
    {
        "symbol": "AAPL",
        "headline": "The Top 5 Analyst Questions From Apple’s Q1 Earnings Call",
        "source": "Yahoo",
        "datetime": 1750249866,
        "url": "https://finnhub.io/api/news?id=95dae6c9224b584c5e1bdbc92693cbb76e4806d012f53794b0160a29360da9fb",
        "summary": "Apple’s first quarter results modestly exceeded Wall Street’s expectations, but the market responded negatively amid persistent concerns about trade policy and margin pressures. Management cited growth in the iPhone, Mac, and iPad lines, along with an all-time high in Services revenue. CEO Tim Cook pointed to new product launches, including the iPhone 16e and M4-powered MacBook Air, as key contributors. However, he acknowledged that headwinds—such as shifting supply chain dynamics and the impact"
    },
    {
        "symbol": "AAPL",
        "headline": "20 companies in the S&P 500 whose investors have gained the greatest rewards from stock buybacks",
        "source": "MarketWatch",
        "datetime": 1750245180,
        "url": "https://finnhub.io/api/news?id=6bf52285b40db16d833dccfe84645ce59c2551f006eb99e503510c636e2837d5",
        "summary": "20 companies in the S&P 500 whose investors have gained the greatest rewards from stock buybacks"
    },
    {
        "symbol": "AAPL",
        "headline": "Trump says Apple is going to buy a lot of Trump gold cards",
        "source": "Finnhub",
        "datetime": 1750242033,
        "url": "https://finnhub.io/api/news?id=4601888d1372f42b6b0bf9ccc07f794cdd2e7e3f8a6bbb287394d165db699f31",
        "summary": "U.S. President DonaldTrump said on Wednesday that Apple would buy a lot of his $5million gold cards that allow immigrants with money to pay fora pathway to obtain U.S. citizenship. ..."
    },
    {
        "symbol": "AAPL",
        "headline": "It’s Time for UnitedHealth to Get Transparent With Its Accounting. But Will It?",
        "source": "Yahoo",
        "datetime": 1750239000,
        "url": "https://finnhub.io/api/news?id=bcd8581b42ab2db871681dead6397f164c9f074234cd5d5ab5a6ab179ec79462",
        "summary": "Investors long trusted UnitedHealth to deliver earnings beats, despite limited transparency. Now they want answers."
    },
    {
        "symbol": "AAPL",
        "headline": "Best Stock to Buy Right Now: Amazon vs. Apple",
        "source": "Yahoo",
        "datetime": 1750236360,
        "url": "https://finnhub.io/api/news?id=42b9a6f5b4527b764f38d85073699dd078f4e3eb20e7efa320b02e434b8cad59",
        "summary": "Amazon's recent stock performance and growth are much better than Apple's.  Apple seems to be stronger financially and has a more attractive valuation than Amazon.  Amazon (NASDAQ: AMZN) stock has skyrocketed more than 220,000% since its initial public offering (IPO) in 1997."
    },
    {
        "symbol": "AAPL",
        "headline": "This Artificial Intelligence (AI) Stock Isn't in Warren Buffett's Portfolio -- but It Follows His Rules",
        "source": "Yahoo",
        "datetime": 1750234560,
        "url": "https://finnhub.io/api/news?id=1a648ae5a7df80f18cb6578306c26d7d01ac8b373d6de1e305c02abd1fe3b953",
        "summary": "Warren Buffett's simple investing strategy has steered Berkshire Hathaway to market-beating returns for six decades.  Buffett rarely invests in tech stocks, but he has made some exceptions for quality names like Apple and Amazon.  There is another tech giant ticking almost all of Buffett's boxes right now, and it's a clear leader in the AI industry."
    },
    {
        "symbol": "AAPL",
        "headline": "The Best Trillion-Dollar Stock to Buy Right Now? Wall Street Has a Clear Answer for Investors.",
        "source": "Yahoo",
        "datetime": 1750234320,
        "url": "https://finnhub.io/api/news?id=8b088f8d71bef171b32989dc50c027a822ea84f9d7fd4f18ff37ce28c4a14530",
        "summary": "Target prices set by Wall Street analysts imply Nvidia is the best trillion-dollar stock to buy right now.  Nvidia reported strong first-quarter financial results despite headwinds related to export restrictions.  Nvidia stock trades at a very reasonable valuation compared to Wall Street’s forward earnings forecast."
    },
    {
        "symbol": "AAPL",
        "headline": "Prediction: 2 Stocks That'll Be Worth More Than Apple 5 Years From Now",
        "source": "Yahoo",
        "datetime": 1750232700,
        "url": "https://finnhub.io/api/news?id=7db6ea1e094e96463435c295a2a8259c5a4032ffdc2d6540c65b3f15fb45be90",
        "summary": "Apple is one of the largest companies in the world, but its growth has slowed, and it is lagging in AI.  Amazon, meanwhile, is an AI leader, using the technology to drive growth and efficiencies.  Meta Platforms is also at the forefront of AI, using the technology to increase user engagement on its platform and improve the effectiveness of its ads."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple WWDC25 – Enhancing ecosystem value over single AI agent",
        "source": "Yahoo",
        "datetime": 1750230946,
        "url": "https://finnhub.io/api/news?id=107c7c5291c50ac614c7908f1f1a9b2cb58d3b17d35f039751078886f18dce76",
        "summary": "Apple’s WWDC25 was about enhancing its user interface with AI capabilities instead of a singular agentic experience. It steered clear of Siri and seems to have learned from its marketing snafus of 2024."
    },
    {
        "symbol": "AAPL",
        "headline": "AI Could Create the First $10 Trillion Company. This Stock Pro Lays Out How.",
        "source": "Yahoo",
        "datetime": 1750230000,
        "url": "https://finnhub.io/api/news?id=11acfd085f9b53a53be39534224e26b89392a5533a153481a6685dc4ed4be2b3",
        "summary": "A conversation with Ulrike Hoffmann-Burchardi of UBS Global Wealth Management. Where she sees the next “transformational innovations.”"
    },
    {
        "symbol": "AAPL",
        "headline": "Why the UK's AIM is struggling 30 years on",
        "source": "Yahoo",
        "datetime": 1750222824,
        "url": "https://finnhub.io/api/news?id=efd046936dc87ca107ceeaa1b3b489ee4698c65816b082578f592311ae9e8be1",
        "summary": "The UK's alternative investment market has seen some major successes since launching 30 years ago but has recently struggled to attract and retain companies."
    },
    {
        "symbol": "AAPL",
        "headline": "US-China Tech Fight Widens After Taiwan Blacklists Huawei",
        "source": "Yahoo",
        "datetime": 1750213068,
        "url": "https://finnhub.io/api/news?id=4be7412f0e0daa9c063554595715b880d88aaa0d089d6790074b35e08707414b",
        "summary": "(Bloomberg) -- Taiwan joined a yearslong US campaign to curtail China’s technological ascent when it blacklisted the country’s AI and chipmaking champions, an unprecedented step that may signal a resurgent effort to isolate its powerful neighbor’s semiconductor sector.Most Read from BloombergSecurity Concerns Hit Some of the World’s ‘Most Livable Cities’As Part of a $45 Billion Push, ICE Prepares for a Vast Expansion of Detention SpaceHow E-Scooters Conquered (Most of) EuropeTaser-Maker Axon Tri"
    },
    {
        "symbol": "AAPL",
        "headline": "Trump flexes security powers to keep global tariff goal alive",
        "source": "Yahoo",
        "datetime": 1750219201,
        "url": "https://finnhub.io/api/news?id=fc1ced760fb837be25ca5fbec7bfa046aea0d3d68a7bb1ca02441eb4e9866cc3",
        "summary": "(Bloomberg) -- Most Read from BloombergSecurity Concerns Hit Some of the World’s ‘Most Livable Cities’How E-Scooters Conquered (Most of) EuropeAs Part of a $45 Billion Push, ICE Prepares for a Vast Expansion of Detention SpaceTaser-Maker Axon Triggers a NIMBY Backlash in its HometownJFK AirTrain Cuts Fares 50% This Summer to Lure Riders Off RoadsThe Trump administration is pressing ahead with another tariff barrage that some trade experts say is more legally sound than the president’s country-by"
    },
    {
        "symbol": "AAPL",
        "headline": "Companies Keep Issuing ‘Stupid’ Earnings for One Simple Reason: It Makes Them Look Better",
        "source": "MarketWatch",
        "datetime": 1750212000,
        "url": "https://finnhub.io/api/news?id=95caaa5ba1cace19a4851a7dbf5068d4e79241df563c0d8e30e03b3875ad9916",
        "summary": "Companies Keep Issuing ‘Stupid’ Earnings for One Simple Reason: It Makes Them Look Better"
    },
    {
        "symbol": "AAPL",
        "headline": "Donald Trump Wants You To Use His New $47 Mobile Plan With A $499 Gold Phone Made In America",
        "source": "Yahoo",
        "datetime": 1750210310,
        "url": "https://finnhub.io/api/news?id=7fdc3c98763879555c9033f82120d6967efd524f12a74780585bf7b3dff08b3b",
        "summary": "President Donald Trump may have a solution to costly mobile phone plans and smartphones like Apple Inc‘s (NASDAQ:AAPL) iPhone being produced in other countries. Trump Mobile is launching soon. Here are the details. What Happened: President Trump's sons Eric Trump and Donald Trump Jr. unveiled Trump Mobile during an event at Trump Tower in New York on Monday, with details of a new mobile phone service to be the latest product launch from the president. \"We've partnered with some of the greatest p"
    },
    {
        "symbol": "AAPL",
        "headline": "Alibaba and Apple team up on local AI models for China",
        "source": "Yahoo",
        "datetime": 1750193156,
        "url": "https://finnhub.io/api/news?id=57df48407d0102f1343cbd9713944839d9119b9e86fc63c1e4d02c1e048fc205",
        "summary": "Four quantization levels on iPhone and Mac signal regulatory green light"
    },
    {
        "symbol": "AAPL",
        "headline": "The Trump Family Is Betting Big on Mobile Phones. Should Apple Stock Investors Be Worried?",
        "source": "Yahoo",
        "datetime": 1750192054,
        "url": "https://finnhub.io/api/news?id=3da9e8c800e927bb7acc8df208c4500ed1921f498f470b8bd3da247b68d57631",
        "summary": "The T1 Mobile-based service will offer monthly subscriptions of $47.45."
    },
    {
        "symbol": "AAPL",
        "headline": "Is ARM's 22% Plummet Over a Year Offering a Fair Price for the Stock?",
        "source": "Yahoo",
        "datetime": 1750180860,
        "url": "https://finnhub.io/api/news?id=13cf31c53e24046da1586b4595fdabbfa969f751f8c5970f6ccd72c485c3e295",
        "summary": "Arm Holdings' 22% stock decline, cooling China growth and soaring valuation raise fresh questions about its upside potential."
    },
    {
        "symbol": "AAPL",
        "headline": "Streaming Finally Outpaces Traditional TV. The Leading Platform Might Surprise You.",
        "source": "Yahoo",
        "datetime": 1750177080,
        "url": "https://finnhub.io/api/news?id=df55c6ce81fb5ce2c8621c4d2020764fd6add02fb06536fca8109f0a60bc6238",
        "summary": "YouTube represented 12.5% of all television viewing in May—the highest share of TV for any streamer to date."
    },
    {
        "symbol": "AAPL",
        "headline": "BABA Down 8% in a Month: Will Partnership With Apple Aid Recovery?",
        "source": "Yahoo",
        "datetime": 1750175940,
        "url": "https://finnhub.io/api/news?id=b5948b8be5236f467320adcef1774b41cd2e93894a445c81801983f02cbdc111",
        "summary": "Alibaba faces regulatory headwinds despite Apple AI progress. Mixed Q4 results suggest holding existing positions or waiting for better entry points in fiscal 2026."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple supplier Jabil plans $500M venture to build AI data centers",
        "source": "Yahoo",
        "datetime": 1750173061,
        "url": "https://finnhub.io/api/news?id=ef25f4e732e69d055022a5d2243d9c916d3ec5ad98cd64635d7e1601109eb0f7",
        "summary": "Jabil plans to invest $500 million to expand its manufacturing and services across the Southeastern U.S. The post Apple supplier Jabil plans $500M venture to build AI data centers appeared first on FreightWaves."
    },
    {
        "symbol": "AAPL",
        "headline": "Motley Fool Analysts Check In on Chime Financial, RH, Adobe, and More",
        "source": "Yahoo",
        "datetime": 1750172760,
        "url": "https://finnhub.io/api/news?id=0fb9311d44d3a779decb05bc4742a2c3742e967f314ba62993db547d801c2bb1",
        "summary": "Malcolm Ethridge, managing partner at Capital Area Planning Group and author of Financial Independence Doesn't Happen by Accident, drops by to chat about the state of cybersecurity and why investors may be a little too pessimistic about Apple's future.  To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center .  Should you invest $1,000 in Chipotle Mexican Grill right now?"
    },
    {
        "symbol": "AAPL",
        "headline": "Trump says he'll extend TikTok sale deadline for third time",
        "source": "Yahoo",
        "datetime": 1750170146,
        "url": "https://finnhub.io/api/news?id=057a6bc6d7f26f85e3a89c2de53518329eb72a44137b76145540b954006a96cf",
        "summary": "President Trump on Tuesday said he'll likely extend the TikTok sale deadline a third time, keeping the app online."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Facing Tough Pricing Decisions",
        "source": "SeekingAlpha",
        "datetime": 1750164981,
        "url": "https://finnhub.io/api/news?id=f56f9089f8ff0158729ea9ee8968c233e0badcf1f3da9bdb8c4f281ad7651bda",
        "summary": "Apple shares have underperformed peers in 2025, falling over 20% amid trade war and tariff concerns. Click here to read an analysis of AAPL stock now."
    },
    {
        "symbol": "AAPL",
        "headline": "Wall Street Lunch: Kraft Heinz To Ditch Artificial Colors",
        "source": "SeekingAlpha",
        "datetime": 1750164480,
        "url": "https://finnhub.io/api/news?id=110a7d9b205170252fd40c8bbd5e3fc29bd476a9621eea39bbf6e3b949e1f3bd",
        "summary": "Kraft Heinz announced it will not launch any new products in the U.S. with Food, Drug & Cosmetic colors, effective immediately."
    },
    {
        "symbol": "AAPL",
        "headline": "Cloud AI Update - Skyhawk Elevates Security With New AI-Driven Partner Program",
        "source": "Yahoo",
        "datetime": 1750163861,
        "url": "https://finnhub.io/api/news?id=9ad92a8724aec524260e22e26262bf0068b5f7f1037f057b4897b9521ce391ca",
        "summary": "Skyhawk Security has announced its new partner program aimed at enhancing cloud AI security through preemptive measures. This initiative is designed to assist partners, including VARs, MSSPs, and consultants, in addressing the surge of cloud security threats by leveraging Skyhawk's advanced Cloud Threat Detection and Response platform. The program offers a flexible framework that enables partners to deliver tailored solutions with an emphasis on return on investment, supported by resources..."
    },
    {
        "symbol": "AAPL",
        "headline": "US court denies Apple’s request to dismiss antitrust case concerning iCloud",
        "source": "Yahoo",
        "datetime": 1750162700,
        "url": "https://finnhub.io/api/news?id=fa4970a4760fcb39789b238715da7425d3b692d76730780b31e596d62464d363",
        "summary": "The lawsuit alleges Apple violates competition laws by forcing users of its devices to back up critical files and device settings on iCloud."
    },
    {
        "symbol": "AAPL",
        "headline": "Netherlands court rules Apple abused App Store dominance",
        "source": "Yahoo",
        "datetime": 1750160273,
        "url": "https://finnhub.io/api/news?id=496205c200b3d8d93ad806bccc27c3b9f03f9ca9799b592d643edc34da836ae5",
        "summary": "Apple was fined €50m by the ACM in 2021 for failing to comply with mandated changes to its App Store practices, which the regulator said violated EU antitrust laws."
    },
    {
        "symbol": "AAPL",
        "headline": "Exclusive-Ferrari delays second EV model to at least 2028 because of weak demand, sources say",
        "source": "Yahoo",
        "datetime": 1750156375,
        "url": "https://finnhub.io/api/news?id=02e935a643305255b9602ef0d279cd5cd74a48e736a40fcbbe3c8dbb81af82ca",
        "summary": "MILAN (Reuters) -Ferrari has delayed plans for its second fully-electric model that was due out in 2026 to at least 2028, because of a lack of demand for high-performance luxury EVs, two sources close to the matter told Reuters.  Known for its roaring petrol engines, Ferrari has sold hybrid models since 2019 and will begin unveiling its first EV in October this year in a three-stage process culminating in a world premiere in the spring of next year.  Aside from the lack of a throaty roar that comes with an electric sports car - the top selling point for many wealthy buyers - automakers have struggled to overcome the fact that EV batteries are far too heavy and simply lack the sustained power of a fossil-fuel engine."
    },
    {
        "symbol": "AAPL",
        "headline": "New Buffett-Inspired ETF Holds Berkshire and Apple. It Aims for 15% Yield.",
        "source": "MarketWatch",
        "datetime": 1750151220,
        "url": "https://finnhub.io/api/news?id=c9a24c2bbdf7c20b356cff5120b58788e21ac81aad0d7a35c06e8ec95b9759f8",
        "summary": "New Buffett-Inspired ETF Holds Berkshire and Apple. It Aims for 15% Yield."
    },
    {
        "symbol": "AAPL",
        "headline": "Buffett Wouldn't Buy AI Yet -- but These 2 Artificial Intelligence (AI) Stocks Fit His Playbook",
        "source": "Yahoo",
        "datetime": 1750146300,
        "url": "https://finnhub.io/api/news?id=b2a25477f3c2616f7c13f8c503c6ef8916457367dc32987027331d36566705e9",
        "summary": "Buffett hasn’t been known to invest in the latest hot technologies, but you still can apply his techniques to tech investing.  Warren Buffett, as chairman, has helped Berkshire Hathaway's portfolio grow to more than $258 billion -- and it's even beaten the S&P 500 index along the way.  Berkshire Hathway has delivered a compounded annual gain of more than 19% over 59 years, while the benchmark has registered a 10% gain over that time period."
    },
    {
        "symbol": "AAPL",
        "headline": "Aqara Smart Lock U200 Lite Brings Smart Access Control to More European Households",
        "source": "Yahoo",
        "datetime": 1750143600,
        "url": "https://finnhub.io/api/news?id=f1435c98218c251557ddf895de4e33a84edb44e0dbdceea59fc405afc4dfaa2d",
        "summary": "NEW YORK, June 17, 2025--Aqara unveils the Smart Lock U200 Lite, offering effortless access control, enhanced security, and a modern keyless lifestyle to European households."
    },
    {
        "symbol": "AAPL",
        "headline": "Häagen-Dazs, Starbucks Mull Overhauls in China to Fend Off Powerful Local Rivals",
        "source": "Yahoo",
        "datetime": 1750142969,
        "url": "https://finnhub.io/api/news?id=8df57997dc5d9121c01689769ee221f0a782004c4717721fee8dd0c75117f396",
        "summary": "(Bloomberg) -- The consumer landscape in China was very different in the 1990s, when Häagen-Dazs and Starbucks ventured in with premium products that were alien to most people. They made huge inroads nonetheless, opening outlets at breakneck pace and raking in revenue. But times are changing, and they, like many other Western brands, are reassessing their approach to the world’s second-biggest economy, including possibly selling their businesses. Most Read from BloombergSecurity Concerns Hit Som"
    },
    {
        "symbol": "AAPL",
        "headline": "Israel and Iran Conflict Tests Stock Markets. Why Investors Should Look Past That.",
        "source": "MarketWatch",
        "datetime": 1750142400,
        "url": "https://finnhub.io/api/news?id=1e11355fb5f0d794c0dbd2d8eaa25210499ffb73bde6e3857afe999d9eea00bc",
        "summary": "Israel and Iran Conflict Tests Stock Markets. Why Investors Should Look Past That."
    },
    {
        "symbol": "AAPL",
        "headline": "Impax U.S. Sustainable Economy Fund Q1 2025 Commentary",
        "source": "SeekingAlpha",
        "datetime": 1750134720,
        "url": "https://finnhub.io/api/news?id=23bf52ec80349eb550b8386c0e65d9677b0d05d4d0653f2de803d342d61fd5fd",
        "summary": "The Impax US Sustainable Economy Fund underperformed the Russell 1000 benchmark in the first quarter. Read more here."
    },
    {
        "symbol": "AAPL",
        "headline": "Goldman Sachs Recommends Buying Apple, Expects Stock to Climb",
        "source": "Yahoo",
        "datetime": 1750134474,
        "url": "https://finnhub.io/api/news?id=3b08335bf74ad9a6498ab59006cc20f7cdff5600412bf7f929077a896f5526e9",
        "summary": "Apple Inc. (NASDAQ:AAPL) is one of the best next generation dividend aristocrat stocks. Goldman Sachs recently highlighted a group of stocks that its analysts believe still have significant growth potential. The firm views these companies as resilient and recommends that investors act quickly to buy them, with Apple Inc. (NASDAQ:AAPL) being one of the top […]"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple (AAPL) Gets $235 Price Target from Morgan Stanley After China iPhone Demand Surprises",
        "source": "Yahoo",
        "datetime": 1750116769,
        "url": "https://finnhub.io/api/news?id=dca2aeab95f3bea0a006edf6a058b6b320e2681056300c2628b99b588ac6c857",
        "summary": "Apple Inc. (NASDAQ:AAPL) is one of the 12 AI Stocks Every Investor Should Be Watching. On June 13, Morgan Stanley reiterated the stock as “Overweight” with a $235 price target. The investment bank said that its Apple checks demonstrate how iPhone and iPad estimates are tracking ahead. The firm also said the iPhone and iPad sell-through in […]"
    },
    {
        "symbol": "AAPL",
        "headline": "Tracking Cliff Asness' AQR Capital Management 13F Portfolio - Q1 2025 Update",
        "source": "SeekingAlpha",
        "datetime": 1750108183,
        "url": "https://finnhub.io/api/news?id=51b45bd42e92498ec52abd010edf461044394127b04a8428f9c402a3b43b4ef8",
        "summary": "AQR Capital's Q1'25 portfolio hits $97.07B, with top picks in AAPL, NVDA, & AMZN. Active portfolio adjustments show a quantitative, diversified approach. See more."
    },
    {
        "symbol": "AAPL",
        "headline": "Life360 Stock Rises On Upbeat Report For Family Tracker Service",
        "source": "Yahoo",
        "datetime": 1750106589,
        "url": "https://finnhub.io/api/news?id=e6d3b8270d8db1b9bca8460d2375ceba287f24a8ac977e7da4ced5e5e10093bd",
        "summary": "Life360 stock rose Monday after a Wall Street analyst raised his price target on the family connection and safety company."
    },
    {
        "symbol": "AAPL",
        "headline": "Herbal Medicine Stock With No Sales Rallies 64,000%",
        "source": "Yahoo",
        "datetime": 1750105818,
        "url": "https://finnhub.io/api/news?id=362d34fd8b45101d56b00b8d01c5a889c0f8964f77ce24e642ca00746c262dca",
        "summary": "(Bloomberg) -- A biotech stock focused on herbal medicine has surged by more than 46,000% so far this year and yet, the company itself has made zero revenue — much less turned a profit. Most Read from BloombergAs Part of a $45 Billion Push, ICE Prepares for a Vast Expansion of Detention SpaceAs American Architects Gather in Boston, Retrofits Are All the RageThe unbelievable rally has transformed Regencell Bioscience Holdings Limited, a penny stock as recently as April, to one worth nearly $30 bi"
    },
    {
        "symbol": "AAPL",
        "headline": "TikTok will go dark June 19 unless Trump gives it another lifeline",
        "source": "Yahoo",
        "datetime": 1750104909,
        "url": "https://finnhub.io/api/news?id=812481f7fd0d447834ae7d1b80445bd93b53575e0c8b723429cd6d2437755cbc",
        "summary": "TikTok will go offline on June 19 unless it can find a buyer or President Trump extends its sale deadline again."
    },
    {
        "symbol": "AAPL",
        "headline": "UBS Sees iPhone Demand Pull-Forward, Outlook Softens",
        "source": "Yahoo",
        "datetime": 1750104873,
        "url": "https://finnhub.io/api/news?id=48cfb227c0f07d4c14e57e3436c7ee9943c2e9985460a579ac0c5b452760f236",
        "summary": "Mid-teens growth in April and May adds 4M units over last year"
    },
    {
        "symbol": "AAPL",
        "headline": "Alibaba and Apple Partner on On-Device AI in China",
        "source": "Yahoo",
        "datetime": 1750104636,
        "url": "https://finnhub.io/api/news?id=b0b30ef43ca5f30856bc925832dceddfd65356a4768a2d80f80fc44599a2e243",
        "summary": "Qwen3 adaptations signal advance toward Apple Intelligence launch"
    },
    {
        "symbol": "AAPL",
        "headline": "Sector Update: Tech Stocks Gain Late Afternoon",
        "source": "Yahoo",
        "datetime": 1750103176,
        "url": "https://finnhub.io/api/news?id=8a21e42db3294bf4a6587b86ebc805b30013b6fc6ac329302aa29aa2d5017872",
        "summary": "Tech stocks rose late Monday afternoon with the Technology Select Sector SPDR Fund (XLK) gaining 1.6"
    },
    {
        "symbol": "AAPL",
        "headline": "Trump’s Smartphone Can’t Be Made in America for $499 by August",
        "source": "Yahoo",
        "datetime": 1750096500,
        "url": "https://finnhub.io/api/news?id=459931b3bbc78cb5955ebdd740497b4a7d0ad34bc8c94fa1e3986c9708c6cd3a",
        "summary": "When the Trump Organization said it would launch a mobile-phone service, it also said it would sell a $499 T1 Phone beginning in August with some specs that beat the current top iPhone.  A press release said the gold Android phone would be “proudly designed and built in the United States.”  In April, when President Trump unveiled his sweeping tariffs, we investigated what it would take to make an iPhone in the U.S. Supply-chain experts agreed the U.S. would need years and many billions of dollars to establish the factories and skillsets needed to match China’s output."
    },
    {
        "symbol": "AAPL",
        "headline": "Trump family to launch $500 gold smartphone",
        "source": "Yahoo",
        "datetime": 1750090223,
        "url": "https://finnhub.io/api/news?id=e2c606d0bfab009d3d73a433711f112f1a513b4b12006b8bb245552d98eef614",
        "summary": "The Trump family has unveiled plans to start selling a $500 (£368) gold-coloured smartphone and launch their own mobile network under the president’s name."
    },
    {
        "symbol": "AAPL",
        "headline": "Big Tech ETF posts sharp rally to outperform S&P 500",
        "source": "MarketWatch",
        "datetime": 1750088783,
        "url": "https://finnhub.io/api/news?id=116b3fd805d15a1cf8daa89d38ba445926c60b62cc5f4c8d026d586922c63629",
        "summary": "Big Tech ETF posts sharp rally to outperform S&P 500"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Is Resilient, But Buybacks Are Diverting Capital From Its Moat (Upgrade)",
        "source": "SeekingAlpha",
        "datetime": 1750087254,
        "url": "https://finnhub.io/api/news?id=2241ea6c6a859b9346dca026381bd42bc7aaf8a9305654fccef67053d9128155",
        "summary": "Apple Inc. faces challenges from AI disrupting its hardware moat. Click for how AAPL management is facing moat degradation from AI disruption, posing stock risk."
    },
    {
        "symbol": "AAPL",
        "headline": "Alibaba launches new Qwen3 AI models for Apple's MLX architecture",
        "source": "Yahoo",
        "datetime": 1750084575,
        "url": "https://finnhub.io/api/news?id=783a8b1b95f6ccb4c368c13b56cbabfaa7bf34206e239cc05fb3fa52e3506386",
        "summary": "China's tech giant Alibaba has launched new Qwen3 artificial intelligence models for Apple's MLX architecture, Alibaba said in a statement on Monday. The new models would be able to run on a range of Apple devices, including iPhone, iPad, MacBook and Mac, Alibaba said in a post on Wechat."
    },
    {
        "symbol": "AAPL",
        "headline": "Meta Investors Cheer as Zuckerberg Doubles Down on AI Commitment",
        "source": "Yahoo",
        "datetime": 1750069004,
        "url": "https://finnhub.io/api/news?id=eb25549230aa60515fbfcd6c17a8528f1855bd3f6be538ede0aeb5f116e68180",
        "summary": "(Bloomberg) -- Meta Platforms Inc. keeps writing bigger checks in pursuit of its artificial intelligence strategy, and traders keep cheering it on, encouraged that the expensive bets will keep paying off.Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureDo World’s Fairs Still Matter?As Part of a $45 Billion Push, ICE Prepares for a Vast Expansion of Detention SpaceNYC Renters Brace for Price Hikes After Broker-Fee BanAs American Architects Gather in Boston, Retrofit"
    },
    {
        "symbol": "AAPL",
        "headline": "Why reviving U.S. tech manufacturing is harder than you think",
        "source": "Yahoo",
        "datetime": 1750081239,
        "url": "https://finnhub.io/api/news?id=7d94cb1d68ac6a02e1e1422d353b8495ec05f58c918f5e96df61e578aa124b9b",
        "summary": "Trump’s wrecking ball to global trade has already proved too fast and too disruptive to encourage companies like Apple to quickly move their production to the U.S."
    },
    {
        "symbol": "AAPL",
        "headline": "Markets Cautious as Israel-Iran Clash Tests Nerves: Markets Wrap",
        "source": "Yahoo",
        "datetime": 1750051899,
        "url": "https://finnhub.io/api/news?id=c51e585ac3ee6b4e87356f6ba936fabbe2a38bcfdfeaa0a9237608d972e92615",
        "summary": "(Bloomberg) -- Investors struck a cautious tone on Monday, as an escalating conflict between Israel and Iran pushed oil prices higher and raised wider questions about the long-run impact.Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureAs Part of a $45 Billion Push, ICE Prepares for a Vast Expansion of Detention SpaceDo World’s Fairs Still Matter?NYC Renters Brace for Price Hikes After Broker-Fee BanAs American Architects Gather in Boston, Retrofits Are All the Rag"
    },
    {
        "symbol": "AAPL",
        "headline": "Neonode Stock: Legal Wins Are Priced In, Rating Downgrade Follows",
        "source": "SeekingAlpha",
        "datetime": 1750079284,
        "url": "https://finnhub.io/api/news?id=1a0901dcd81da13b82b74c8fad404cde9ed548f6aa8ecb988b9e5f3b4cafeae9",
        "summary": "Discover how Neonode Inc.â\u0080\u0099s legal victories, scalable licensing model, and index inclusion are driving a stock rally and growth. Click for my NEON stock update."
    },
    {
        "symbol": "AAPL",
        "headline": "The Trump family's next venture, a mobile phone company",
        "source": "Yahoo",
        "datetime": 1750077899,
        "url": "https://finnhub.io/api/news?id=8f9b654a926df045dac5404e63d149aa78cf521f24fb25cf7fb8d5fa4ecfdaea",
        "summary": "The Trump family said it is licensing its name to a new mobile phone service, the latest in a string of ventures that have been announced while Donald Trump is in the White House despite ethical concerns that the U.S. president could mold public policy for personal gain.  Eric Trump, one of President Donald Trump’s sons running The Trump Organization, said the new venture called, Trump Mobile, will sell phones that will be built in the U.S., and the phone service will maintain a call center in the country as well.  A $1.5 billion partnership to build golf courses, hotels and real estate projects in Vietnam was approved last month, but the deal was in the works before Trump was elected."
    },
    {
        "symbol": "AAPL",
        "headline": "Streetwise: Time to Look Again at Investing in Europe?",
        "source": "Yahoo",
        "datetime": 1750076102,
        "url": "https://finnhub.io/api/news?id=c2cb0109a03f01b368699b4e780499d5e5f8e0c216db8d88e4941b293699e089",
        "summary": "A common reader complaint is that their experiments investing in Europe over the years have always proved disappointing, if not disastrous.  It’s easy to see why: From 2007 to the end of last year, MSCI’s European index underperformed the U.S. in 13 out of 17 years, in dollar terms.  An American investor in Europe made just 108% with dividends reinvested, against 485% if they stuck with U.S. stocks."
    },
    {
        "symbol": "AAPL",
        "headline": "Market Chatter: Apple May Face New EU Charges for Non-Compliance With Digital Markets Act",
        "source": "Yahoo",
        "datetime": 1750073885,
        "url": "https://finnhub.io/api/news?id=b03522e8cada676042b51d82b9a24904c85ed957264eeafcb70e841b20878e43",
        "summary": "Apple (AAPL) could soon face another charge sheet from the European Union if it fails to comply with"
    },
    {
        "symbol": "AAPL",
        "headline": "Dutch court confirms Apple abused dominant position in dating apps",
        "source": "Finnhub",
        "datetime": 1750069758,
        "url": "https://finnhub.io/api/news?id=3de51ed5a857d36c9a02ec5072605767e30b60dfd39ecde13e1f56294aef7ea4",
        "summary": "A Dutch court on Mondayconfirmed a 2021 consumer watchdog 's ruling saying that Applehad abused its dominant position by imposing unfairconditions on providers of dating apps in the App Store. ..."
    },
    {
        "symbol": "AAPL",
        "headline": "TSMC Rises. Why U.S., China Tensions Are Reshaping the Chip Manufacturer.",
        "source": "MarketWatch",
        "datetime": 1750067520,
        "url": "https://finnhub.io/api/news?id=2c2397016dcd1d035d57d4adf88afc456f0a5362ec47fe00e5eeae9f8e7b8cd6",
        "summary": "TSMC Rises. Why U.S., China Tensions Are Reshaping the Chip Manufacturer."
    },
    {
        "symbol": "AAPL",
        "headline": "Trump Organization Plans Smartphone, Wireless Plan",
        "source": "MarketWatch",
        "datetime": 1750066800,
        "url": "https://finnhub.io/api/news?id=0cd4df9c6c7cdec755ec7d59a70144b0a3ca35c32f33b6ae50c1a4b19419eb88",
        "summary": "Trump Organization Plans Smartphone, Wireless Plan"
    },
    {
        "symbol": "AAPL",
        "headline": "Big Tech’s Furious Rally Forces Options Pros to Line Up Hedges",
        "source": "Yahoo",
        "datetime": 1750066200,
        "url": "https://finnhub.io/api/news?id=cf2f933a771f733ff5266335c1d07af2e5bc8fb8065227e22b5c3e5ebd1d6b21",
        "summary": "(Bloomberg) -- Big Tech has led the furious rebound in US stocks from the tailspin that followed President Donald Trump’s sweeping April 2 tariff edict. Now options traders are signaling that they see the pricey cohort as especially vulnerable to another round of trade war-driven volatility.Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureDo World’s Fairs Still Matter?As Part of a $45 Billion Push, ICE Prepares for a Vast Expansion of Detention SpaceNYC Renters Bra"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple: Be Patient For The Long-Term Prize - Don't Rush Tim Cook",
        "source": "SeekingAlpha",
        "datetime": 1750065878,
        "url": "https://finnhub.io/api/news?id=a5dacd764e4942f83ecf8dd7d76bb706c264daafb32759036e0bf18306d20904",
        "summary": ""
    },
    {
        "symbol": "AAPL",
        "headline": "CEO moves between industries",
        "source": "Finnhub",
        "datetime": 1750064052,
        "url": "https://finnhub.io/api/news?id=4720ca7e8ba3e0e684268c5e21521a6f8d0d2b057104ce0a8747c9deb1e2208a",
        "summary": "June 16 - Gucci owner Kering is setto hire Renault Chief Executive Luca de Meo, fivesources told Reuters on Monday, in a move that will see de Meopivot from the automotive to the luxury sector...."
    },
    {
        "symbol": "AAPL",
        "headline": "1 Unstoppable Stock That Could Join the $1 Trillion Club Alongside Nvidia, Apple, Amazon, Microsoft, and More",
        "source": "Yahoo",
        "datetime": 1750061700,
        "url": "https://finnhub.io/api/news?id=2447ad0c36ed0c1c97a60da16184519b454dda074451be1c08ec5c7f3b531972",
        "summary": "The American economy produced nine companies with valuations of over $1 trillion, including powerhouses like Nvidia, Apple, and Microsoft.  Oracle could join that exclusive club within the next few years, thanks to soaring demand for its artificial intelligence (AI) infrastructure.  Apple then crossed the most exclusive milestone of all in 2018, when it became the world's first $1 trillion company."
    },
    {
        "symbol": "AAPL",
        "headline": "Why RCS is gaining traction among business and consumers alike",
        "source": "Yahoo",
        "datetime": 1750060800,
        "url": "https://finnhub.io/api/news?id=867902bdeaeeca6254246365b967ca7ea2ac0fd734d3ba7e6662037abeb42075",
        "summary": "Rich communication services \"is an app-like experience in the messaging channel,” said Brenda Fackler, VP of client services at Sinch. “It is a total game changer.”"
    },
    {
        "symbol": "AAPL",
        "headline": "Rivian: We Believe In The Larger Vision Here",
        "source": "SeekingAlpha",
        "datetime": 1750060800,
        "url": "https://finnhub.io/api/news?id=669c330484d28ccd2526ad1888234d1c8b1bb0b4386cc77e18b3eddd22084a3e",
        "summary": "We are increasingly confident in Rivian as a source of long-term growth potential. But why are we were not willing to take this ride? Click here to find out. "
    },
    {
        "symbol": "AAPL",
        "headline": "My Top 5 AI Stocks to Buy Before the Second Half",
        "source": "Yahoo",
        "datetime": 1750059900,
        "url": "https://finnhub.io/api/news?id=45f72c5425853b979e24168e2e58c6e04dc1764591c9abc7d681e9436dded469",
        "summary": "AI stocks drove market gains over the past two years, but earlier this year they led declines.  Investors, worried about the potential impact of import tariffs on the economy, avoided growth stocks.  The first half of the year was a turbulent one for stocks in general amid concern President Trump's planned import tariffs would hurt the economy."
    },
    {
        "symbol": "AAPL",
        "headline": "My Biggest Regrets As A Dividend Investor",
        "source": "SeekingAlpha",
        "datetime": 1750057500,
        "url": "https://finnhub.io/api/news?id=a8405233d4e9f1116f544d582b7473e48ebc9a6dbf45e9feb5ae10eabcd61eca",
        "summary": "Dividend investing has been a very effective strategy for me over the years, but it is far from easy. Check out my biggest regrets as a dividend investor."
    },
    {
        "symbol": "AAPL",
        "headline": "Ton van Garderen waves goodbye at Apple Netherlands",
        "source": "Finnhub",
        "datetime": 1750042873,
        "url": "https://finnhub.io/api/news?id=7cf3f9c78a8467ea57573cabd0ae638c4fd8bf5f95c6102adeb3a94a1809fd76",
        "summary": "Copyright © Emerce 2023Ton van Garderen is stepping down from Apple Netherlands after 44 years. Formally, he held the position of sales director there. Soon I will take some time for myself to..."
    },
    {
        "symbol": "AAPL",
        "headline": "Adnoc Makes $19 Billion Takeover Bid for Australia’s Santos",
        "source": "Yahoo",
        "datetime": 1750038870,
        "url": "https://finnhub.io/api/news?id=a50ba402a96d1d333bfa5863a75f92cd9f5b9ff4acc61259801aa9dbde65f940",
        "summary": "(Bloomberg) -- Abu Dhabi National Oil Co. made a $18.7 billion offer for Australian fossil fuel producer Santos Ltd., the latest move by the Middle Eastern company to expand production of liquefied natural gas.Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureAs Part of a $45 Billion Push, ICE Prepares for a Vast Expansion of Detention SpaceDo World’s Fairs Still Matter?NYC Renters Brace for Price Hikes After Broker-Fee BanAs American Architects Gather in Boston, Re"
    },
    {
        "symbol": "AAPL",
        "headline": "US pushes Vietnam to decouple from Chinese tech, sources say",
        "source": "Finnhub",
        "datetime": 1750036343,
        "url": "https://finnhub.io/api/news?id=3022bacd8a29d1cbeff691cb18028ac22c8a81439d81d6e5cdf56602d65f5b27",
        "summary": "The United States is pushingVietnam in tariff talks to reduce the use of Chinese tech indevices that are assembled in the country before being exportedto America, three people briefed on the matter..."
    },
    {
        "symbol": "AAPL",
        "headline": "Australians Equally Distrust Both Trump and Xi, Survey Finds",
        "source": "Yahoo",
        "datetime": 1750017600,
        "url": "https://finnhub.io/api/news?id=9b3d830cb74cdf2a477c3ec90ccd63efb4ad67658a889a310c82768909c02968",
        "summary": "(Bloomberg) -- Australians are equally distrustful of both US President Donald Trump and Chinese leader Xi Jinping, according to a new survey, complicating Canberra’s task of managing ties with its key security ally and biggest trading partner.Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureAs Part of a $45 Billion Push, ICE Prepares for a Vast Expansion of Detention SpaceDo World’s Fairs Still Matter?NYC Renters Brace for Price Hikes After Broker-Fee BanAs Americ"
    },
    {
        "symbol": "AAPL",
        "headline": "TDV: Technology Dashboard For June",
        "source": "SeekingAlpha",
        "datetime": 1749997941,
        "url": "https://finnhub.io/api/news?id=dfdcb88eeb2ba4479d427689e094cce86a7c7db84807f4fc1735ee06061f2962",
        "summary": ""
    },
    {
        "symbol": "AAPL",
        "headline": "AI Beyond Data Centers: 3 Stocks Poised to Dominate AI's Next Big Move",
        "source": "Yahoo",
        "datetime": 1749984300,
        "url": "https://finnhub.io/api/news?id=34970f411037dac3059496e58df556f1a8f5f57e998b19031d6e3f6bdad7d360",
        "summary": "Data centers receive much of the AI hype, but the longer-term opportunity lies beyond them, in the real-world uses that will affect people's lives."
    },
    {
        "symbol": "AAPL",
        "headline": "Impax Sustainable Allocation Fund Q1 2025 Commentary",
        "source": "SeekingAlpha",
        "datetime": 1749982860,
        "url": "https://finnhub.io/api/news?id=ac72484ea92ad51b25b5cb238a33f6161c356f8bfe39e905ad376a756a3b7185",
        "summary": "The Impax Sustainable Allocation Fund underperformed its blended benchmark (60% S&P 500/40% Bloomberg Barclays US Aggregate Bond Index). Read more here."
    },
    {
        "symbol": "AAPL",
        "headline": "Warren Buffett Has $90 Billion Invested in These 9 Artificial Intelligence (AI) Stocks. Here's the Best of the Bunch.",
        "source": "Yahoo",
        "datetime": 1749980940,
        "url": "https://finnhub.io/api/news?id=dc96a2998dff6b6ccacb1637b90cad435c62b2f6706c11eacc6b2464c33980b3",
        "summary": "Berkshire Hathaway owns only two AI stocks.  The best Buffett AI stock should benefit tremendously as organizations build and deploy AI models in the cloud.  Warren Buffett readily admits that he doesn't understand artificial intelligence (AI)."
    },
    {
        "symbol": "AAPL",
        "headline": "Wedbush Reiterates $270 Target on Apple (AAPL), Citing Hopes for AI Execution",
        "source": "Yahoo",
        "datetime": 1749980871,
        "url": "https://finnhub.io/api/news?id=ed8dd28c950d5c52ef333b2ea4ace7b4d493a77b6f10e4a97a34d52a1201f2e7",
        "summary": "Apple Inc. (NASDAQ:AAPL) is one of the 10 best tech stocks to buy according to billionaires right now. On June 10, following Apple’s keynote at the 2025 Worldwide Developers Conference (WWDC), Wedbush analyst Daniel Ives reaffirmed his Outperform rating on the stock, along with a $270 price target. In his post-event note, Ives noted that while the […]"
    },
    {
        "symbol": "AAPL",
        "headline": "3 Reasons Why This Beaten-Down Growth Stock Could Trounce the S&P 500 in the Second Half of 2025",
        "source": "Yahoo",
        "datetime": 1749980700,
        "url": "https://finnhub.io/api/news?id=a4559b791e1ffdf2693653ea4e33e9185238ce413c67a8f5074ff34193572a53",
        "summary": "Apple is a fair value for an industry-leading company.  Apple (NASDAQ: AAPL) is in the bottom 10% of S&P 500 stocks when measuring year-to-date performance.  Here are three reasons why the sell-off in Apple has gone far enough, and why the beaten-down growth stock could be a great buy for the second half of 2025."
    },
    {
        "symbol": "AAPL",
        "headline": "Here's How Many Shares of Apple Stock You Should Own to Get $1,000 in Yearly Dividends",
        "source": "Yahoo",
        "datetime": 1749979980,
        "url": "https://finnhub.io/api/news?id=a7309de5c37fcd431c575f3219338ea3908055ee2178703f4269e63bbfd94621",
        "summary": "Apple renewed its dividend in 2012.  When people think about Apple (NASDAQ: AAPL), products like the iPhone likely come to mind.  Apple has also become a reliable dividend payer since restarting payouts in 2012."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple: WWDC 2025 Was A Major Point Of Failure",
        "source": "SeekingAlpha",
        "datetime": 1749943768,
        "url": "https://finnhub.io/api/news?id=c8e78814ce25e975e4b8cdbc2f8595a0a143a221bc69002fd1065e5415829ecb",
        "summary": "Apple seems lost in a rapidly evolving market environment. Read how AAPL stock is struggling with long-term trends and repeated missteps like WWDC 2025."
    },
    {
        "symbol": "AAPL",
        "headline": "Week in Review: WWDC 2025 recap",
        "source": "Yahoo",
        "datetime": 1749920880,
        "url": "https://finnhub.io/api/news?id=9fd9f4035d433868f2a6ea0abc9863c0b66a45cb0e5fff7dcd4b23fbbf88c52a",
        "summary": "Welcome back to Week in Review! We have lots for you this week, including what came out of WWDC 2025; The Browser Company's AI browser; OpenAI's partnership with Mattel; and your iPad might finally be a true work machine."
    },
    {
        "symbol": "AAPL",
        "headline": "The App Store’s new AI-generated tags are live in the beta",
        "source": "Yahoo",
        "datetime": 1749916909,
        "url": "https://finnhub.io/api/news?id=a6c29901cdc2ce35fbe08c2875fd003b6794681b53f2feb1773d81b454aebf6e",
        "summary": "Apple’s plans to improve App Store discoverability using AI tagging techniques are now available in the developer beta build of iOS 26. However, the tags do not appear on the public App Store as of yet, nor are they informing the App Store Search algorithm on the public store. Of course, with any upcoming App […]"
    },
    {
        "symbol": "AAPL",
        "headline": "JUST: ESG ETF Doing The Job, But Not The Best",
        "source": "SeekingAlpha",
        "datetime": 1749901948,
        "url": "https://finnhub.io/api/news?id=4675da96ec78d4e7506d48cc041c9c739d55b5bb618f338e731cc767a0f41f38",
        "summary": "JUST offers ESG-focused exposure to Russell 1000 stocks with solid fundamentals but trails peers in impact, fees, and volume. Find out why JUST ETF is a hold."
    },
    {
        "symbol": "AAPL",
        "headline": "Generational Buying Opportunity: Dividend Growth Machines For The AI Boom",
        "source": "SeekingAlpha",
        "datetime": 1749896968,
        "url": "https://finnhub.io/api/news?id=521f4f5dc4cc136a8e0fefd6c2f1e6695b97c48e0f148acd918780a37b14a8e3",
        "summary": "The AI boom may define the next decade, but most stocks are already priced for perfection. Learn why a few overlooked plays still offer a rare buying opportunity."
    },
    {
        "symbol": "AAPL",
        "headline": "3 No-Brainer Artificial Intelligence (AI) Growth Stocks to Buy With $200 Right Now",
        "source": "Yahoo",
        "datetime": 1749894900,
        "url": "https://finnhub.io/api/news?id=3e8de88fcb69df9683d589397ba8f51c843d6e8cbc1ab46d63d419d87025e546",
        "summary": "Finding value in artificial intelligence (AI) stocks can be tough, especially with just $200. These three options meet the mark, though."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple just made 3 great new privacy and security enhancements—but missed these 3 opportunities",
        "source": "Yahoo",
        "datetime": 1749891600,
        "url": "https://finnhub.io/api/news?id=cf63fdbb8b68ba2ff99793f6b379bcbbf191398d985f43d6287305a0d92b7580",
        "summary": "iOS 26, iPadOS 26, and macOS 26 will let you keep your data even more secure and private. But Apple could go further."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Reroutes 97% Of Foxconn iPhone Exports From India To US Between March And May As Trump Threatens 25% Tariff On Non-US-Made iPhones: Report",
        "source": "Yahoo",
        "datetime": 1749864633,
        "url": "https://finnhub.io/api/news?id=e6e09272a3b910aa2ad43bda8603d5eaee273b11d13bd35ce685e5e46f9909d0",
        "summary": "Apple Inc. (NASDAQ:AAPL) has reportedly increased its iPhone shipments from India to the U.S. in the past few months, as the tech giant moves to protect its U.S. sales from the impact of escalating tariffs on China-made goods. What Happened: Between March and May, 97% of iPhones exported by Foxconn, also known as Hon Hai Precision Industry Co., Ltd (OTC:HNHAF), from India were sent to the U.S., according to customs data reviewed by Reuters. That's a steep jump from the 2024 average of just over"
    },
    {
        "symbol": "AAPL",
        "headline": "Why Superintelligent AI Isn’t Taking Over Anytime Soon",
        "source": "Yahoo",
        "datetime": 1749862800,
        "url": "https://finnhub.io/api/news?id=d8a8fdff582d1f12029c88a262539099f47ce6dbec8dd363dee443ce310de8d1",
        "summary": "Despite claims from top names in AI, researchers argue that fundamental flaws in reasoning models mean bots aren’t on the verge of exceeding human smarts."
    },
    {
        "symbol": "AAPL",
        "headline": "Why Apple (AAPL) Dipped More Than Broader Market Today",
        "source": "Yahoo",
        "datetime": 1749851102,
        "url": "https://finnhub.io/api/news?id=6964bc22b1f8f8cb497ea5fed7ff5e25394f6420885d615ec285cbf8c943a839",
        "summary": "Apple (AAPL) reached $196.45 at the closing of the latest trading day, reflecting a -1.38% change compared to its last close."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple's $4.4B India Play: The Secret iPhone Shift That's Reshaping U.S. Supply Chains",
        "source": "Yahoo",
        "datetime": 1749848806,
        "url": "https://finnhub.io/api/news?id=7f50a3430d3f330186c8e2210c57b92e24672399363c5c7be52ea6b0235fedf3",
        "summary": "As Trump targets China, Apple quietly reroutes billions in iPhone exports through India--and it's just getting started"
    },
    {
        "symbol": "AAPL",
        "headline": "Spotify Widens Lead As Go-To Music App",
        "source": "Yahoo",
        "datetime": 1749840138,
        "url": "https://finnhub.io/api/news?id=c795abb7336d9d5a473d727a114320bbf0bde140b940409b3b8295c2be4f0209",
        "summary": "A new survey shows that Spotify is widening its lead as the preferred music streaming app among consumers in the U.S. and U.K."
    },
    {
        "symbol": "AAPL",
        "headline": "Trump Seeks to Register His Name for Mobile Phone Service",
        "source": "Yahoo",
        "datetime": 1749838672,
        "url": "https://finnhub.io/api/news?id=306bdf191308b039b10ca2789aa2b0aeca63e9f51dcfaac45f6a82109ca20c37",
        "summary": "(Bloomberg) -- DTTM Operations LLC, the entity that manages trademarks on behalf of President Donald Trump, has applied to use his name and the term T1 for telecom services.Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureTrump’s Military Parade Has Washington Bracing for Tanks and WeaponryNYC Renters Brace for Price Hikes After Broker-Fee BanDo World’s Fairs Still Matter?As Part of a $45 Billion Push, ICE Prepares for a Vast Expansion of Detention SpaceThe request"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple’s Liquid Glass design is paving the way for AR glasses",
        "source": "Yahoo",
        "datetime": 1749837615,
        "url": "https://finnhub.io/api/news?id=31228598f16d899c40ca0a858e5daacc994e04d6d2e34eb1ba7277b7303b076d",
        "summary": "This visual overhaul gives us a glimpse into the design of Apple's rumored AR glasses, which will reportedly debut next year."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple (NasdaqGS:AAPL) Faces Antitrust Lawsuit Over Wi-Fi Calling Practices",
        "source": "Yahoo",
        "datetime": 1749835071,
        "url": "https://finnhub.io/api/news?id=d201477a29352a7cc3d491cc0992c0a72277a17cfd79b19c20f72e10cec02c56",
        "summary": "Apple (NasdaqGS:AAPL) recently faced a legal challenge from VoIP-Pal.com Inc., which initiated an antitrust lawsuit involving Apple and other tech giants. The lawsuit, targeting their alleged suppression of lawful competition in standalone Wi-Fi Calling, comes amidst Apple's introduction of several updates across its product lines, including significant enhancements in iPadOS, iOS, and macOS. Despite these developments, Apple's share price moved by a modest 2% last week. This reflects the..."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple stock could catch a short-term bid with cheap valuation: Morgan Stanley",
        "source": "Yahoo",
        "datetime": 1749834771,
        "url": "https://finnhub.io/api/news?id=956cea844d2a74f506c40d3f9b4238b7e1079adbe9c89b74dab9aef3e4c3101c",
        "summary": "Investing.com -- Apple shares may benefit from short-term upside as deep discounting in China fuels stronger-than-expected iPhone and iPad sales, according to Morgan Stanley."
    },
    {
        "symbol": "AAPL",
        "headline": "IYY Vs. IWB: Fast Facts On Two Top 1000 ETFs",
        "source": "SeekingAlpha",
        "datetime": 1749834669,
        "url": "https://finnhub.io/api/news?id=bb23c4c9da775d560fc7582de3042748f0528f9aef7d508f9282757fd41fd0c2",
        "summary": "IYY and IWB are two similar large and mid-cap ETFs, holding about 1,000 of the largest US-traded companies. Read the full comparison of the stocks here."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple (AAPL) Risks Falling Behind as WWDC's AI Reveal Disappoints",
        "source": "Yahoo",
        "datetime": 1749832931,
        "url": "https://finnhub.io/api/news?id=a6ca952d58c5ba977aa1afec30c8ceb1878fe5f971883c94253976eee4a24b1d",
        "summary": "WWDC Leaves Apple's AI Prospects in Question Amid Fierce Competition"
    },
    {
        "symbol": "AAPL",
        "headline": "Is Roku's Strategy for Devices Segment Holding Back Its Profitability?",
        "source": "Yahoo",
        "datetime": 1749832020,
        "url": "https://finnhub.io/api/news?id=c7ad656b23481c69d9844f5ad562fe5944fc9d016c2e6a56f358eaeb0290f132",
        "summary": "ROKU's Devices arm fuels user growth but drags on margins, despite strong unit sales and strategic importance."
    },
    {
        "symbol": "AAPL",
        "headline": "This 1999 email from a tech pioneer helped me think about Apple’s WWDC",
        "source": "Yahoo",
        "datetime": 1749824281,
        "url": "https://finnhub.io/api/news?id=7decb4562e362c066479a71abeaad799ca38a81caf2aac89fbe7aa310c8f1943",
        "summary": "Jef Raskin instigated the Mac project in 1979. Twenty years later, he was dismayed with the state of personal computing. What would he think today?"
    },
    {
        "symbol": "AAPL",
        "headline": "Tariffs Create Most Patriotic Earnings Season Yet as US Firms Pander to Trump",
        "source": "Yahoo",
        "datetime": 1749823200,
        "url": "https://finnhub.io/api/news?id=19ee345f02d5855811a03ce921735841387c1163de93cd579254ad7b56907087",
        "summary": "(Bloomberg) -- President Donald Trump’s tariff regime may not be having the desired effect of bringing manufacturing back to the US yet, but it’s making companies sound a lot more patriotic.Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureTrump’s Military Parade Has Washington Bracing for Tanks and WeaponryNYC Renters Brace for Price Hikes After Broker-Fee BanDo World’s Fairs Still Matter?NY Long Island Rail Service Resumes After Grand Central FireAt least that’s w"
    },
    {
        "symbol": "AAPL",
        "headline": "Foxconn Ships 97% of India-Made iPhones to U.S.",
        "source": "Yahoo",
        "datetime": 1749821454,
        "url": "https://finnhub.io/api/news?id=36d257de3bbe548eb241e9052d006f1860d721213ba503ba2365b5c89d6198f7",
        "summary": "$3.2 billion in March-May exports reflect Apple's tariff-avoidance strategy"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Grabs China iPhone Crown in May",
        "source": "Yahoo",
        "datetime": 1749820822,
        "url": "https://finnhub.io/api/news?id=da4a1e2faf0208c211e2a5dd4a9be4713196178f47ec946dfd70d4ab7d0557d3",
        "summary": "Global shipments up 15% as U.S. and China drive growth"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Tops China's Market After Massive iPhone Discounts",
        "source": "Yahoo",
        "datetime": 1749819102,
        "url": "https://finnhub.io/api/news?id=945d9db2430d58fcd12cefac8b0bc47ec41d9c79a5f35fe3d301d98b7dccf486",
        "summary": "Apple Regains Top Spot in China Smartphone Market on iPhone Sales Surge"
    },
    {
        "symbol": "AAPL",
        "headline": "Cloud AI Update - Cloud Computing's Transformative Growth and Future Opportunities",
        "source": "Yahoo",
        "datetime": 1749818289,
        "url": "https://finnhub.io/api/news?id=13021d646a0417302856df353204adaafae34586f24af1982c62715091ac7e94",
        "summary": "The global cloud computing market is experiencing significant growth, projected to expand from USD 766 billion in 2025 to USD 3.50 trillion by 2035, with a CAGR of 14.623%. This expansion is driven by advancements in hybrid cloud, SaaS, and AI technologies, with North America spearheading developments. Key challenges including rising service costs and security concerns remain, particularly for SMEs, but innovations like Artificial General Intelligence and IoT present opportunities. Major..."
    },
    {
        "symbol": "AAPL",
        "headline": "APPLE INC : UBS reaffirms its Neutral rating",
        "source": "Finnhub",
        "datetime": 1749816436,
        "url": "https://finnhub.io/api/news?id=867034a5599ef86a785a81b4f1cfbc4030e96e69614bbe765ce055653f74da2e",
        "summary": "David Vogt from UBS retains his Neutral opinion on the stock. The target price is unchanged and still at USD 210."
    },
    {
        "symbol": "AAPL",
        "headline": "Epic Games Tanks A Key Apple Growth Driver",
        "source": "SeekingAlpha",
        "datetime": 1749814745,
        "url": "https://finnhub.io/api/news?id=5711728964fc15de09eb608b661a95046800648deb8529620bd9152295d4dc1b",
        "summary": "Apple Inc.'s App Store fees face scrutiny as court rulings and regulations push for alternative payments. Click for my updated look at AAPL stock prospects."
    },
    {
        "symbol": "AAPL",
        "headline": "What's Eating Apple?",
        "source": "SeekingAlpha",
        "datetime": 1749813818,
        "url": "https://finnhub.io/api/news?id=0565db54f08501ba71b829e8aef4284a5a581cc6e3475175b86663d343894705",
        "summary": "Apple is relatively weak compared to the broader market and peers. Click here to find out why I rate AAPL stock is a Hold."
    },
    {
        "symbol": "AAPL",
        "headline": "The 2025 stock market rally is about more than just the 'Magnificent 7': Morning Brief",
        "source": "Yahoo",
        "datetime": 1749808842,
        "url": "https://finnhub.io/api/news?id=ac69a4f4d971044389766552981af480e124bc4ee6d2c93b4f74894da2cea191",
        "summary": "After two years of few S&P 500 companies outperforming the index,  market participation is broadening in 2025."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple's iPhones Top Smartphone Sales in China",
        "source": "Finnhub",
        "datetime": 1749799391,
        "url": "https://finnhub.io/api/news?id=2499f27398c35882e73b6b22e86bc75aa1352672a35239ad338bc96b035209a1",
        "summary": "By Kimberley Kao Apple's iPhones were the best-selling smartphones in China last month, according to a closely followed research firm, marking a turnaround after continued market-share losses and..."
    },
    {
        "symbol": "AAPL",
        "headline": "Warren Buffett Is Wagering 72% of Berkshire Hathaway's $283 Billion of Invested Capital on These 7 Unstoppable Stocks",
        "source": "Yahoo",
        "datetime": 1749798360,
        "url": "https://finnhub.io/api/news?id=7aa29434fab01ad6dd521c0b8992e7d9edeefd693236b0fff9abfe5b0f16e982",
        "summary": "The Oracle of Omaha has concentrated a majority of Berkshire's invested assets in a handful of his best ideas."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple's iPhone sales capture top spot in Chinese market in May, Counterpoint Research says",
        "source": "Yahoo",
        "datetime": 1749796139,
        "url": "https://finnhub.io/api/news?id=3c06d60c2043f7d045c0b5cb2a2a2b5e26759a971937cd640e4391c40fccf61e",
        "summary": "The increase in global sales was primarily driven by a return to growth in Apple's two largest markets, China and the United States, preliminary data from Counterpoint Research showed.  \"Q2 iPhone performance looks promising at the moment, but as always, swings either way are dictated by two markets - the U.S. and China,\" Ivan Lam, Senior Analyst at Counterpoint Research said.  Calculations based on data from the government-affiliated China Academy of Information and Communications Technology showed that April shipments of foreign-branded phones in China rose to 3.52 million units from 3.50 million a year earlier."
    },
    {
        "symbol": "AAPL",
        "headline": "Impax Ellevate Global Women's Leadership Fund Q1 2025 Commentary",
        "source": "SeekingAlpha",
        "datetime": 1749791940,
        "url": "https://finnhub.io/api/news?id=316577c6f240ae7b7ec97c54bca8c839df1a84fa3376c8a75b1ce5259d9bf6e2",
        "summary": "During the first quarter, the Global Womenâ\u0080\u0099s Leadership portfolio lagged global developed market equities overall in the period."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple: upheaval in supply chain",
        "source": "Finnhub",
        "datetime": 1749791439,
        "url": "https://finnhub.io/api/news?id=4a130acba0ea862265a19ec032e127b92c3520b8c5ad4662669ed827d3472a14",
        "summary": "Apple has already mentioned its intention to review its supply chain in order to produce iPhones for the US in India. More than just a mention, the group very quickly overhauled its entire logistics..."
    },
    {
        "symbol": "AAPL",
        "headline": "NCZ: Convertibles Should Be Superior To Traditional Bonds",
        "source": "SeekingAlpha",
        "datetime": 1749790873,
        "url": "https://finnhub.io/api/news?id=25e7a635b27ef50353821546dcaaa6cfc33eeb3d10a073ce1cfda0c9d8c93a85",
        "summary": "Virtus Convertible & Income Fund II has a high 11.61% yield, inflation protection, and recent outperformance. Read here for an analysis of NCZ CEF."
    },
    {
        "symbol": "AAPL",
        "headline": "Make it a summer to remember - on us!",
        "source": "Finnhub",
        "datetime": 1749789609,
        "url": "https://finnhub.io/api/news?id=4b9f43985aad2cce189d121d5365ad4b47df5b8973f2a46dbc112177195175fd",
        "summary": "* Verizon is heating things up with bundled smartphone, smartwatch, tablet and home internet deals that keep the good vibes rollingWhat you need to know:* Verizon has the savings you need for the..."
    },
    {
        "symbol": "AAPL",
        "headline": "2 S&P 500 Stocks to Keep an Eye On and 1 to Ignore",
        "source": "Yahoo",
        "datetime": 1749789340,
        "url": "https://finnhub.io/api/news?id=e20f378b43f50daf88e468f4c3e371ea74e93788ceb42e77ee63c2d78260e69f",
        "summary": "While the S&P 500 (^GSPC) includes industry leaders, not every stock in the index is a winner. Some companies are past their prime, weighed down by poor execution, weak financials, or structural headwinds."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Execs on AI Setbacks, Siri Delays, iPads and More (Full Interview)",
        "source": "Yahoo",
        "datetime": 1749787260,
        "url": "https://finnhub.io/api/news?id=6a0a3a668f6e4e8d83ead692eb8dbafa2ee4b26eeceeec7d77c15537aa982dfa",
        "summary": "WSJ’s Joanna Stern sits down with Apple software chief Craig Federighi and marketing head Greg Joswiak at WWDC 2025 in Cupertino to talk about the future of AI, what happened to Siri, the new Liquid Glass redesign, iPads vs. Macs, tariffs and more."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple (AAPL) Stock Holds Steady as Analysts Call WWDC25 a ‘Transition Year’",
        "source": "Yahoo",
        "datetime": 1749784294,
        "url": "https://finnhub.io/api/news?id=428d8d049eaffa774bea997d664266cb3c709a49f62693f4ac080759c02d51bf",
        "summary": "Apple Inc. (NASDAQ:AAPL) is one of the 15 AI Stocks Making Waves on Wall Street. On June 10, Evercore ISI analyst Amit Daryanani reiterated an “Outperform” rating and $250.00 price target on Apple Inc. (NASDAQ:AAPL). Highlighting the recent keynote, analysts stated how it matched expectations of a transition year and that there were minimal announcements. One […]"
    },
    {
        "symbol": "AAPL",
        "headline": "Exclusive-Foxconn sends 97% of India iPhone exports to US as Apple tackles Trump's tariffs",
        "source": "Yahoo",
        "datetime": 1749783697,
        "url": "https://finnhub.io/api/news?id=abfcc9f459678346c0f2678417af618ae365eba45042d03da92e31ae785461af",
        "summary": "NEW DELHI (Reuters) -Nearly all the iPhones exported by Foxconn from India went to the United States between March and May, customs data showed, far above the 2024 average of 50% and a clear sign of Apple's efforts to bypass high U.S. tariffs imposed on China.  The numbers, being reported by Reuters for the first time, show Apple has realigned its India exports to almost exclusively serve the U.S. market, when previously the devices were more widely distributed to countries including the Netherlands, the Czech Republic and Britain.  During March-May, Foxconn exported iPhones worth $3.2 billion from India, with an average 97% shipped to the United States, compared to a 2024 average of 50.3%, according to commercially available customs data seen by Reuters."
    },
    {
        "symbol": "AAPL",
        "headline": "Foxconn sends 97% of India iPhone exports to US as Apple tackles Trump's tariffs",
        "source": "Yahoo",
        "datetime": 1749783697,
        "url": "https://finnhub.io/api/news?id=184bc95fd77b3db6e213afd18a34b294712f088c4ad2a83499dbfaa81fbe4fd4",
        "summary": "NEW DELHI (Reuters) -Nearly all the iPhones exported by Foxconn from India went to the United States between March and May, customs data showed, far above the 2024 average of 50% and a clear sign of Apple's efforts to bypass high U.S. tariffs imposed on China.  The numbers, being reported by Reuters for the first time, show Apple has realigned its India exports to almost exclusively serve the U.S. market, when previously the devices were more widely distributed to countries including the Netherlands, the Czech Republic and Britain.  During March-May, Foxconn exported iPhones worth $3.2 billion from India, with an average 97% shipped to the United States, compared to a 2024 average of 50.3%, according to commercially available customs data seen by Reuters."
    },
    {
        "symbol": "AAPL",
        "headline": "Fund manager has blunt words on Apple and its products",
        "source": "Yahoo",
        "datetime": 1749771420,
        "url": "https://finnhub.io/api/news?id=417cec345d2fb7774079332981df125d40155cd5508bd4e7ed1e91d446175240",
        "summary": "One expert thinks the tech leader may be departing from its founder's legacy."
    },
    {
        "symbol": "AAPL",
        "headline": "Silent Giant TSMC Returns to the Peak of its Powers as the AI Boom Continues",
        "source": "Yahoo",
        "datetime": 1749769380,
        "url": "https://finnhub.io/api/news?id=05c6eddfe2d75d721493e79f87ed6c286cec1062be2f547b2001c02c2d3f2652",
        "summary": "AI and U.S. growth stocks have rebounded to record highs after their slump in February and March, rewarding those who bought the dip, especially in the IT and AI sectors. At the heart of this resurgence is Taiwan Semiconductor Manufacturing (TSM), better known as simply “TSMC”, the silent powerhouse behind the AI boom. The stock is within grasp of yet another historic high around the $225 mark. TSMC produces the chips that drive everything from Nvidia’s GPUs to Apple’s iPhones, and it’s now expe"
    },
    {
        "symbol": "AAPL",
        "headline": "Consumer sentiment, Regeneron meeting, Apple WWDC: What to Watch",
        "source": "Yahoo",
        "datetime": 1749769200,
        "url": "https://finnhub.io/api/news?id=8b87e4a761c6ca2c22de35ca37142d5ac38f9ff0e00370640a3bf9272141f364",
        "summary": "Market Domination Overtime hosts Julie Hyman and Josh Lipton preview the top market stories and headlines Wall Street will be paying attention to tomorrow, Friday, June 13, including June's preliminary consumer sentiment reading, Regeneron Pharmaceuticals' (REGN) annual shareholder meeting, and the closing day of Apple's (AAPL) 2025 Worldwide Developers Conference (WWDC). To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Targets Spring 2026 for Release of Delayed Siri AI Upgrade",
        "source": "Yahoo",
        "datetime": 1749761131,
        "url": "https://finnhub.io/api/news?id=2279b1a5047735260fac0afde5cdc177aa5257ac61cf195703d258a4e0edb565",
        "summary": "(Bloomberg) -- Apple Inc. has set an internal release target of spring 2026 for its delayed upgrade of Siri, marking a key step in its artificial intelligence turnaround effort. Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureTrump’s Military Parade Has Washington Bracing for Tanks and WeaponryNYC Renters Brace for Price Hikes After Broker-Fee BanDo World’s Fairs Still Matter?NY Long Island Rail Service Resumes After Grand Central FireThe company’s Siri team is ai"
    },
    {
        "symbol": "AAPL",
        "headline": "Saylor Says 'Apple Should Buy Bitcoin,' As Cramer Says Buybacks Are Not Working",
        "source": "Yahoo",
        "datetime": 1749760264,
        "url": "https://finnhub.io/api/news?id=e2bf7788979657b566a8960dbe84c2d35a0b60748bf5782aab838e00a6fbf6c8",
        "summary": "The saying goes, “What is good for the goose is good for the gander.” Could this also apply to investment strategies? In recent years, several firms have turned to Bitcoin as a means to increase shareholder value after feeling they had reached a ..."
    },
    {
        "symbol": "AAPL",
        "headline": "Here are Apple’s top AI announcements from WWDC 2025",
        "source": "Yahoo",
        "datetime": 1749750792,
        "url": "https://finnhub.io/api/news?id=43163e6c6746fe19dbdf11fb89a23de8b7c398de21abf8428d85b87ed7562e1b",
        "summary": "At WWDC 2025, Apple announced several AI features, such as a workout coach, live translation, and more."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple fixes new iPhone zero-day bug used in Paragon spyware hacks",
        "source": "Yahoo",
        "datetime": 1749748001,
        "url": "https://finnhub.io/api/news?id=f7dee17ab495b3fd0313552c36b2af361a83f3621290a41adb1c0afdcc9eb807",
        "summary": "The iPhone maker quietly updated a February security advisory to publicize a flaw that was used to hack at least two journalists in Europe."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple Targets Spring 2026 For Release Of Delayed Siri AI Upgrade - Bloomberg News",
        "source": "Finnhub",
        "datetime": 1749747130,
        "url": "https://finnhub.io/api/news?id=4ba65b03f296eacb6b95c75c6202f85c4a524d387f7e5296c8ad1ae45c9dd920",
        "summary": "June 12 - * APPLE TARGETS SPRING 2026 FOR RELEASE OF DELAYED SIRI AIUPGRADE- BLOOMBERG NEWSSource text: https://tinyurl.com/mwssmfjrFurther company coverage: ..."
    },
    {
        "symbol": "AAPL",
        "headline": "AMD Stock: Why It's Going Up And Should Continue Going Up",
        "source": "SeekingAlpha",
        "datetime": 1749742941,
        "url": "https://finnhub.io/api/news?id=065d24182f5efbb246fe7c844922aa4c573404fb95d8735531dde788b1b2f04e",
        "summary": "New AI accelerators, EPYC's continued dominance, and resurgent desktop CPU sales have Advanced Micro Devices, Inc. set up for success. Click for my AMD update."
    },
    {
        "symbol": "AAPL",
        "headline": "Your iPad is your new computer",
        "source": "Yahoo",
        "datetime": 1749742627,
        "url": "https://finnhub.io/api/news?id=ef2e069abc8344dd2bf9cb9b20b49c48c8d2488cfc2a20bb58f2017c060f9a95",
        "summary": "iPadOS 26 makes the iPad function more like a MacBook, rather than a giant iPhone, making it a boon for productivity."
    },
    {
        "symbol": "AAPL",
        "headline": "'Mag 7' turned 'Mid 7': Is 2025 the end of tech dominance?",
        "source": "Yahoo",
        "datetime": 1749740705,
        "url": "https://finnhub.io/api/news?id=2f218e146cd6412bc8f327548dc7223b969a036c673573650383c518d34cdf5b",
        "summary": "The tech sector (XLK), specifically the \"Magnificent Seven,\" made up of Nvidia (NVDA), Alphabet (GOOG, GOOGL), Tesla (TSLA), Microsoft (MSFT), Amazon (AMZN), Meta (META), and Apple (AAPL), was a significant driver of market gains in 2023 and 2024. However, 2025 has been a different story so far. Yahoo Finance Markets Reporter Josh Schafer and Wall Street Alliance Group partner Aadil Zaman sit down with Brad Smith on Catalysts to take a look at how the Magnificent Seven has underperformed the wider market in 2025. To watch more expert insights and analysis on the latest market action, check out more Catalysts here."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple: OpenAI Wrecks The Bullish Thesis (Rating Downgrade)",
        "source": "SeekingAlpha",
        "datetime": 1749739278,
        "url": "https://finnhub.io/api/news?id=baf9f635c37e771818c18abf5f452687b67711dcc0a8eccbc45090023f31e13b",
        "summary": "Apple Inc. has been performing well with solid growth in its services business. Click here to find out why I am neutral on AAPL stock."
    },
    {
        "symbol": "AAPL",
        "headline": "CoreWeave Shorts Face 150% Borrow Costs After $1.6 Billion Loss",
        "source": "Yahoo",
        "datetime": 1749735323,
        "url": "https://finnhub.io/api/news?id=6f1d4b41132275e42a486fb8bff36045d7fb1e419a55ecf8a1e4ce9f65b59d00",
        "summary": "(Bloomberg) -- CoreWeave Inc.’s soaring share price is torching short sellers who are paying high prices to bet that the stock will soon fall back to earth.Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureTrump’s Military Parade Has Washington Bracing for Tanks and WeaponryNYC Renters Brace for Price Hikes After Broker-Fee BanNY Long Island Rail Service Resumes After Grand Central FireDo World’s Fairs Still Matter?A more than two-fold gain in CoreWeave’s shares sin"
    },
    {
        "symbol": "AAPL",
        "headline": "The Zacks Analyst Blog Highlights Apple, Walt Disney, AMD, Armanino Foods of Distinction and Optex Systems",
        "source": "Yahoo",
        "datetime": 1749734760,
        "url": "https://finnhub.io/api/news?id=a0bb58a81dfe5968425b6e2df9612aa19618ecbe62157a3d4916e2fd5b67ad83",
        "summary": "AAPL, DIS, and AMD show mixed performance as analysts spotlight service growth, park gains, and data center strength."
    },
    {
        "symbol": "AAPL",
        "headline": "The Zacks Analyst Blog Highlights Apple, Amazon, Microsoft and Alphabet",
        "source": "Yahoo",
        "datetime": 1749733980,
        "url": "https://finnhub.io/api/news?id=0619163f86bf4ee9b66a7eb3a6a044ac05d8ea6eeb108dafab63897af3b16765",
        "summary": "AAPL unveils Apple Intelligence and Liquid Glass at WWDC25, but weak China sales and valuation raise concerns."
    },
    {
        "symbol": "AAPL",
        "headline": "Berkshire Stock Hits Correction Zone as Buffett Premium Shrinks",
        "source": "MarketWatch",
        "datetime": 1749733080,
        "url": "https://finnhub.io/api/news?id=14410ad5defb96b1ac13b7b75ed52c071e75d3839191626700ed2023a673b6f7",
        "summary": "Berkshire Stock Hits Correction Zone as Buffett Premium Shrinks"
    },
    {
        "symbol": "AAPL",
        "headline": "How To Earn $500 A Month From Apple Stock",
        "source": "Yahoo",
        "datetime": 1749730803,
        "url": "https://finnhub.io/api/news?id=e48e2535a1fd5565d98f22214732b8910b739dab97219a5822dd2b28463655a8",
        "summary": "Apple Inc. (NASDAQ:AAPL) shares closed lower on Wednesday as investors continued to digest announcements from this week's Worldwide Developers Conference. The much-anticipated event showcased updates across Apple's operating systems, including a new design language called \"Liquid Glass,\" but left some analysts and investors underwhelmed by its advancements in artificial intelligence. With the recent buzz around Apple, some investors may be eyeing potential gains from the company's dividends too."
    },
    {
        "symbol": "AAPL",
        "headline": "Adobe Earnings, Bond Auction, Inflation Data: Still to Come This Week",
        "source": "Yahoo",
        "datetime": 1749730801,
        "url": "https://finnhub.io/api/news?id=0e7c059070029b1bbf74df26124bcafc64b99fc85328bbd0b3ea169bdd1ca8c5",
        "summary": "Thursday will bring producer-price index data from May, providing another reading on inflation and how prices have changed as a result of tariff policies. Wednesday's consumer-price index showed weaker-than-expected core inflation."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple: Risk Of Falling Behind In AI Race Increases After Disappointing WWDC Event",
        "source": "SeekingAlpha",
        "datetime": 1749730419,
        "url": "https://finnhub.io/api/news?id=e1e7b221686e7ce202600632d9f86b1385c426edb4c90ebcc6e2e695e9bd79cb",
        "summary": "Apple Inc.'s lag in AI innovation, legal challenges, and modest growth could impact its stock performance and services revenue. Click for my AAPL update."
    },
    {
        "symbol": "AAPL",
        "headline": "Researchers confirm two journalists were hacked with Paragon spyware",
        "source": "Yahoo",
        "datetime": 1749729600,
        "url": "https://finnhub.io/api/news?id=0fd4cf3171893f4cda500c666cafbb21552a9907228a0325b97559dccaf9a3af",
        "summary": "The confirmation of two hacked victims further deepens an ongoing spyware scandal that, for now, appears largely focused on the Italian government."
    },
    {
        "symbol": "AAPL",
        "headline": "Xi Plays Long Game on US-China Trade as Trump Seeks Quick Wins",
        "source": "Yahoo",
        "datetime": 1749728585,
        "url": "https://finnhub.io/api/news?id=cd637309fb55f2f897814baea68d54a19c5f37153a41273e80e0941bc7808a72",
        "summary": "(Bloomberg) -- While Donald Trump hailed the outcome of trade talks in London, Xi Jinping walked away with an understated strategic gain: a negotiating process that buys China time and helps defuse the threat of more harmful tariffs and technology curbs.Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureTrump’s Military Parade Has Washington Bracing for Tanks and WeaponryNYC Renters Brace for Price Hikes After Broker-Fee BanNY Long Island Rail Service Resumes After G"
    },
    {
        "symbol": "AAPL",
        "headline": "Alphabet: Still A Textbook Buying Opportunity On Dips",
        "source": "SeekingAlpha",
        "datetime": 1749727800,
        "url": "https://finnhub.io/api/news?id=54be6100e9345f0b9230fa1486a7167a01eb5e3dbd232b7b06d8df3b9d24ab43",
        "summary": ""
    },
    {
        "symbol": "AAPL",
        "headline": "Can new iOS 26 software save Apple's stock? What investors should know",
        "source": "MarketWatch",
        "datetime": 1749724620,
        "url": "https://finnhub.io/api/news?id=541871c17e6b2e569bb09c59cf077201e2e54c45419c68b932b5fbdb861fec4a",
        "summary": "Can new iOS 26 software save Apple's stock? What investors should know"
    },
    {
        "symbol": "AAPL",
        "headline": "The AI Bubble: Advanced AI Faces A 'Complete Accuracy Collapse'",
        "source": "SeekingAlpha",
        "datetime": 1749722485,
        "url": "https://finnhub.io/api/news?id=0131eec8de621a4277d5abf9d3736df1d8060749283cb0c9075456d56f0cbd72",
        "summary": "Discover why Apple Inc.'s study reveals critical challenges in advanced AI models, hinting at a Gen AI bubble burstâ\u0080\u0094and its impact on the S&P. Click for more."
    },
    {
        "symbol": "AAPL",
        "headline": "Prediction: 3 Stocks Berkshire Hathaway Will Add to Its Portfolio After Warren Buffett Steps Down as CEO",
        "source": "Yahoo",
        "datetime": 1749721500,
        "url": "https://finnhub.io/api/news?id=68970949d79ccdc4aae0f4390d5097c156628866e5874085ec5330e9adfa97b1",
        "summary": "Berkshire could have multiple new holdings as Abel may want to put his stamp on the company.  There are some solid blue-chip stocks that aren't in Berkshire's portfolio that arguably should be in there already.  Next year, Berkshire Hathaway will have a new CEO."
    },
    {
        "symbol": "AAPL",
        "headline": "JZ Capital net asset value falls, maintains US portfolio is strong",
        "source": "Finnhub",
        "datetime": 1749721089,
        "url": "https://finnhub.io/api/news?id=2d3d3f19fe0d3a7e3edbfa4a365b6032e69b630366f0252293a0b05cd0ca76ad",
        "summary": "JZ Capital Partners Ltd on Thursday said its US portfolio remained strong, despite a drop in net asset value during financial 2025. The Guernsey, Channel Islands-domiciled investment firm targets US..."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple: Strategic Missteps In The AI Era",
        "source": "SeekingAlpha",
        "datetime": 1749720143,
        "url": "https://finnhub.io/api/news?id=e2e7f36f369eb11d3560e632dc8022a618ceac57d5c8db890b28e5e978bb7eb0",
        "summary": "Apple has fallen behind competitors in AI innovation due to delayed promises, technical constraints from its privacy-focused approach and underinvestment in..."
    },
    {
        "symbol": "AAPL",
        "headline": "Pomerantz Law Firm Investigates Claims On Behalf of Investors of Apple Inc. - AAPL",
        "source": "Finnhub",
        "datetime": 1749718903,
        "url": "https://finnhub.io/api/news?id=02442450aae0b39699efb6d3c30cde6fa06a0a3a0587e1bc3c644e260b580401",
        "summary": "NEW YORK, June 12, 2025 /PRNewswire/ -- Pomerantz LLP is investigating claims on behalf of investors of Apple Inc.  .  Such investors are advised to contact Danielle Peyton at..."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple WWDC underwhelms fans in a crucial upgrade",
        "source": "Yahoo",
        "datetime": 1749701348,
        "url": "https://finnhub.io/api/news?id=62e0b7e4f76a5fe3002ff9475a07e6aa7a811aa8253fa6065e1e46b10e7de4d4",
        "summary": "The company's WWDC announcements reveal a problem."
    },
    {
        "symbol": "AAPL",
        "headline": "Nvidia, Samsung Plan Investments in Robotics Startup Skild AI",
        "source": "Yahoo",
        "datetime": 1749687452,
        "url": "https://finnhub.io/api/news?id=50c5660f48bc9d3afe08e2102cf1fd5654c1acdbbf4ad3dadc6547754158b3a3",
        "summary": "(Bloomberg) -- Samsung Electronics Co. and Nvidia Corp. will take minority stakes in Skild AI Inc. as they seek to bolster their work in the emerging consumer robotics industry. Most Read from BloombergShuttered NY College Has Alumni Fighting Over Its FutureTrump’s Military Parade Has Washington Bracing for Tanks and WeaponryNYC Renters Brace for Price Hikes After Broker-Fee BanNY Long Island Rail Service Resumes After Grand Central FireNYC Mayoral Candidates All Agree on Building More Housing."
    },
    {
        "symbol": "AAPL",
        "headline": "Tracking George Soros's 13F Portfolio - Q1 2025 Update",
        "source": "SeekingAlpha",
        "datetime": 1749681323,
        "url": "https://finnhub.io/api/news?id=e4d50f4b3984e229ed6848177b77b6b022f08f0c646bbc944640289071aa804d",
        "summary": ""
    },
    {
        "symbol": "AAPL",
        "headline": "Apple to Open its AI Models to App Developers",
        "source": "Yahoo",
        "datetime": 1749677474,
        "url": "https://finnhub.io/api/news?id=5b92751f9f885de55c75e2020a8ee0c5560f292c14fe874a0f7acd88ef173739",
        "summary": "Apple Inc. (NASDAQ:AAPL) is one of the best Dow stocks to invest in. In one of the recent developments, the company is giving millions of app developers access to its AI models for the first time, aiming to leverage its vast hardware and software ecosystem to stay ahead of competitors. At its annual developer event, […]"
    },
    {
        "symbol": "AAPL",
        "headline": "Apple (AAPL) Gets Buy Rating Despite AI Letdown at WWDC25, Says Goldman Sachs",
        "source": "Yahoo",
        "datetime": 1749674755,
        "url": "https://finnhub.io/api/news?id=f680fae5840e68e2aa3081d18a5e654f7d526f2453bd3b46a0fffbe65f96d7b8",
        "summary": "Apple Inc. (NASDAQ:AAPL) is one of the 10 AI Stocks on Wall Street’s Radar. One of the most notable analyst calls on Tuesday, June 10th, was for Apple Inc. (NASDAQ:AAPL). Goldman Sachs reiterated the stock as “Buy” with a $253 price target. The tech giant hosted its annual developers’ conference on Monday, failing to introduce substantial artificial […]"
    },
    {
        "symbol": "AAPL",
        "headline": "Top Research Reports for Apple, Walt Disney & AMD",
        "source": "Yahoo",
        "datetime": 1749673140,
        "url": "https://finnhub.io/api/news?id=137a0b7aeb1fb337b9c287817f4a552b402c4adfd16a54b94ee24c3f8028df78",
        "summary": "AAPL, DIS, and AMD stand out in Zacks' latest top research, each navigating challenges while delivering strategic growth in Q3 2025."
    },
    {
        "symbol": "AAPL",
        "headline": "All of the new features coming to Apple’s iOS apps",
        "source": "Yahoo",
        "datetime": 1749670740,
        "url": "https://finnhub.io/api/news?id=743c93f641ae8f59a9546e9e6cae0f59cc3fb8f2fc332657bc019157b350291a",
        "summary": "New features launching with iOS 26 include significant updates like Call Screening, more travel-friendly features in Wallet, and highly requested group chat features in Messages."
    },
    {
        "symbol": "AAPL",
        "headline": "Jim Cramer Notes “It’s Been Hard to Own Apple Lately”",
        "source": "Yahoo",
        "datetime": 1749670375,
        "url": "https://finnhub.io/api/news?id=b2293ba7e2a1e545fea7473819ce8e550c9cda0712774159052c8aa6a8ffaeb2",
        "summary": "Apple Inc. (NASDAQ:AAPL) is one of the 11 stocks on Jim Cramer’s radar. Cramer started his game plan for the week with Apple Inc. (NASDAQ:AAPL) as he touched on the impact of the president’s tariff policies on the company. “Apple stock just had a second straight positive week. That’s an unusual occurrence of late, and […]"
    },
    {
        "symbol": "AAPL",
        "headline": "‘Classic Apple': Why Apple is taking the slow road with AI",
        "source": "Yahoo",
        "datetime": 1749668586,
        "url": "https://finnhub.io/api/news?id=cdd570644f8613bddce2460ec67d3b826f0acbdc8810dd86611cbb257ad58b97",
        "summary": "Apple is slow-rolling its AI rollout. Whether by design or necessity, it perfectly fits the company's MO."
    },
    {
        "symbol": "AAPL",
        "headline": "At WWDC, Apple says it will use AI to tag apps to improve discoverability on the App Store",
        "source": "Yahoo",
        "datetime": 1749665853,
        "url": "https://finnhub.io/api/news?id=8117e4de672359635dd851a11ede3fb6958b17ffd82b29d47d9afd6d6cd07254",
        "summary": "Apple will begin using AI technology to power the discovery of apps on the App Store, the company announced at this week’s Worldwide Developers Conference (WWDC 25). In a session focused on updates to App Store Connect, its app distribution platform for developers, the company announced it will introduce App Store Tags — labels that […]"
    },
    {
        "symbol": "AAPL",
        "headline": "Alphabet Stock Is Cheaper Than the S&P 500. Is the Google Parent a Value Trap?",
        "source": "MarketWatch",
        "datetime": 1749659640,
        "url": "https://finnhub.io/api/news?id=d8ef81b2d8d96bdbcf20e2f6cbc008ac815bc4fb06de95a55711d3d9387a92b3",
        "summary": "Alphabet Stock Is Cheaper Than the S&P 500. Is the Google Parent a Value Trap?"
    },
    {
        "symbol": "AAPL",
        "headline": "Buy, Sell or Hold the Apple Stock Post the WWDC25 Announcements?",
        "source": "Yahoo",
        "datetime": 1749659520,
        "url": "https://finnhub.io/api/news?id=5104e77844fbcaccd2d8016031d74b71ee930f23646e551be9f0503f2cba5a9d",
        "summary": "AAPL unveils Liquid Glass design and new services; but tepid AI impact and valuation weigh on shares."
    },
    {
        "symbol": "AAPL",
        "headline": "Trump Says Trade ‘Deal With China Is Done;’ Bessent Calls Talks ‘Successful’",
        "source": "MarketWatch",
        "datetime": 1749638700,
        "url": "https://finnhub.io/api/news?id=6b5c739d7d025f1f7084138f88e157ee13d9ae6a2fbbe4e5fe737edb0f8adfc5",
        "summary": "Trump Says Trade ‘Deal With China Is Done;’ Bessent Calls Talks ‘Successful’"
    },
    {
        "symbol": "AAPL",
        "headline": "WhatsApp fights Yvette Cooper’s ‘dangerous’ attempt to break encryption",
        "source": "Yahoo",
        "datetime": 1749649675,
        "url": "https://finnhub.io/api/news?id=6648e415f88f54144bb1f7c654e18a25c30d1c874662eac967643dee8ff6bea9",
        "summary": "Mark Zuckerberg’s WhatsApp has challenged a “dangerous” attempt by the Home Office to secretly force Apple to build a backdoor in its encryption technology."
    },
    {
        "symbol": "AAPL",
        "headline": "Megacap Stocks Aren’t Trading in Tandem Anymore. Why They Are Still Winners.",
        "source": "MarketWatch",
        "datetime": 1749643560,
        "url": "https://finnhub.io/api/news?id=e27fbd69f08f1071d6deaf55c245b790ead650f57f674c07fae2300b70f105c7",
        "summary": "Megacap Stocks Aren’t Trading in Tandem Anymore. Why They Are Still Winners."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple : expands tools to help parents protect kids and teens online",
        "source": "Finnhub",
        "datetime": 1749643506,
        "url": "https://finnhub.io/api/news?id=4ebeffd55dfe6be2262501c4af8119614ffe548b78fcb705bbbfc7ca50860a50",
        "summary": "UPDATE June 11, 2025 Apple expands tools to help parents protect kids and teens online Including new ways to manage Child Accounts, the..."
    },
    {
        "symbol": "AAPL",
        "headline": "American Century Ultra Fund Q1 2025 Commentary",
        "source": "SeekingAlpha",
        "datetime": 1749639120,
        "url": "https://finnhub.io/api/news?id=04e8bd40576b16454a25c757d0e461def194ba003a41f3b8a185d7e1fb8bcf91",
        "summary": "Large-cap value marked the only U.S. stock category that posted a quarterly gain. Mid-cap stocks broadly outperformed large-cap stocks. Read more here."
    },
    {
        "symbol": "AAPL",
        "headline": "Apple's AI Hesitation At WWDC 2025: What's At Stake",
        "source": "SeekingAlpha",
        "datetime": 1749637223,
        "url": "https://finnhub.io/api/news?id=1b742848d85e26368403e32b21c36bd01891107152bfc5525b9c3a1b97315ce7",
        "summary": ""
    },
    {
        "symbol": "AAPL",
        "headline": "AAPL Investors Have Opportunity to Join Apple Inc. Fraud Investigation with the Schall Law Firm",
        "source": "Finnhub",
        "datetime": 1749636967,
        "url": "https://finnhub.io/api/news?id=bd662089ba1c5bbbb36b00c81901359fd012b901b51bc6dbce7006313350c064",
        "summary": "LOS ANGELES, June 11, 2025 /PRNewswire/ -- The Schall Law Firm, a national shareholder rights litigation firm, announces that it is investigating claims on behalf of investors of Apple Inc. for..."
    },
    {
        "symbol": "AAPL",
        "headline": "3 Reasons to Buy This Beaten-Down Warren Buffett Stock",
        "source": "Yahoo",
        "datetime": 1749635220,
        "url": "https://finnhub.io/api/news?id=f681d77a102cd04fd62740816eed266e91d7621d93bdc5e27ce574ff67d703a0",
        "summary": "Apple generates plenty of cash to reinvest in the business.  Warren Buffett is still bullish on the stock.  Apple (NASDAQ: AAPL) stock has taken a beating this year, with its shares down by 19% as of this writing."
    },
    {
        "symbol": "AAPL",
        "headline": "American Century Focused International Growth Fund Q1 2025 Commentary",
        "source": "SeekingAlpha",
        "datetime": 1749628800,
        "url": "https://finnhub.io/api/news?id=e6c766f01f4b809fdde3ea46abec25c2fc8cfe45f3d159c100d25f2291596d3c",
        "summary": "The portfolio continues to invest in companies we believe are strong and improving and have improvement that is sustainable."
    }
]